[{
	"date": "1/1",
	"poem": "Before the beginning\n\n\tOr angels and man began,\n\n\tAnd even after the end,\n\n\tGod, Three in One You have ever been\n\n\tLiving, giving, sharing within,\n\n\tYou, the best gift that can be given.",
	"verse": "John 1:1",
	"versetext": "In the beginning was the Word, and the Word was with God, and the Word was God.\n"
}, {
	"date": "1/2",
	"poem": "Spirit of God like a dove\n\n\tAbove this formless void, the deep, dark,\n\n\tboiling turmoil of my heart,\n\n\tAbove the chaos of my life,\n\n\tBrood over me in all wise love.\n\n\tMake me Your new creation in Christ.",
	"verse": "Gen. 1:2",
	"versetext": "The earth was formless and empty. Darkness was on the surface of the deep and God’s Spirit was hovering over the surface of the waters.\n"
}, {
	"date": "1/3",
	"poem": "The first written word that God said\n\n\tWas “let there be light.”\n\n\tWhen His Word enters us, it gives sight,\n\n\tThen our darkness is dead.",
	"verse": "Gen. 1:3",
	"versetext": "God said, “Let there be light,” and there was light.\n"
}, {
	"date": "1/4",
	"poem": "Our hearts were in darkness, and dark was in us\n\n\tUntil we saw light shining from the face of Jesus.\n\n\tThen, for us, it was the first day again\n\n\tAnd we became a new creation.",
	"verse": "2Cor. 4:6",
	"versetext": "seeing it is God who said, “Light will shine out of darkness,” who has shone in our hearts, to give the light of the knowledge of the glory of God in the face of Jesus Christ.\n"
}, {
	"date": "1/5",
	"poem": "A day starts at night\n\n\tAnd we too begin in the dark,\n\n\tUntil His Word enters our heart\n\n\tAnd makes everything bright",
	"verse": "Gen. 1:5",
	"versetext": "God called the light “day”, and the darkness he called “night”. There was evening and there was morning, the first day.\n"
}, {
	"date": "1/6",
	"poem": "God works, dividing and setting apart:\n\n\tDaylight from dark,\n\n\tWaters parted to become sea and sky,\n\n\tFrom the wet oceans, land that is dry.\n\n\tThen vegetation sprang from earth.\n\n\tOur Maker is doing the same with the church,\n\n\tA new creation which He separates and sanctifies.",
	"verse": "Gen. 1:4",
	"versetext": "God saw the light, and saw that it was good. God divided the light from the darkness.\n"
}, {
	"date": "1/7",
	"poem": "Next, He adorns and multiplies:\n\n\tEnhancing the heavens with ruling lights,\n\n\tFlooding waters above and below with abundant life.\n\n\tThen diverse creatures on land, under man’s dominion.\n\n\tAnd finally, from the man, a wife.\n\n\tOur creator is doing the same with His Bride\n\n\tAdding grace upon grace until we reign at His side.",
	"verse": "Gen. 1:16",
	"versetext": "God made the two great lights: the greater light to rule the day, and the lesser light to rule the night. He also made the stars.\n"
}, {
	"date": "1/8",
	"poem": "A new year, month and week has begun\n\n\tAnd like His Book, Chapter and Verse One\n\n\tStart this year, month and this day\n\n\t‘In the beginning’ with God, the same way.",
	"verse": "Gen. 1:1",
	"versetext": "In the beginning, God created the heavens and the earth.\n"
}, {
	"date": "1/9",
	"poem": "Maker and Lord of the entire Universe,\n\n\tObserver and Ruler of the minutest thing,\n\n\tMaster of all spirits above, on and below the earth\n\n\tYou control the greatest and least of all being.",
	"verse": "Act. 17:28",
	"versetext": "‘For in him we live, and move, and have our being.’ As some of your own poets have said, ‘For we are also his offspring.’\n"
}, {
	"date": "1/10",
	"poem": "In Christ you have been created again\n\n\tAccording to God’s eternal plan.\n\n\tOrdained before creation began,\n\n\tTo be a walking work for Him.",
	"verse": "Eph. 2:10",
	"versetext": "For we are his workmanship, created in Christ Jesus for good works, which God prepared before that we would walk in them.\n"
}, {
	"date": "1/11",
	"poem": "Like sleeping seeds, from earth we will suddenly spring and sprout\n\n\tAs soon as we hear from clouds that secret and select shout sing out.",
	"verse": "1Pet. 1:23",
	"versetext": "having been born again, not of corruptible seed, but of incorruptible, through the word of God, which lives and remains forever.\n"
}, {
	"date": "1/12",
	"poem": "The first Adam kept a garden\n\n\tThe Last was planted in one.\n\n\tThe first man came up from the ground\n\n\tFrom Second comes down from heaven.",
	"verse": "1Cor. 15:45",
	"versetext": "So also it is written, “The first man, Adam, became a living soul.”\n The last Adam became a life-giving spirit.\n"
}, {
	"date": "1/13",
	"poem": "There have only ever been two men.\n\n\tThe First was he who came up from earth.\n\n\tThe Second, the Son of Man, Who came down from heaven.\n\n\tEvery person ever born is a child of Adam,\n\n\tBut from the Second are only those who have had New Birth.\n\n\tWhose family do you want to be in?",
	"verse": "1Cor. 15:47",
	"versetext": "The first man is of the earth, made of dust. The second man is the Lord from heaven.\n"
}, {
	"date": "1/14",
	"poem": "God is good all the time.\n\n\tAll the time God is good.\n\n\tGod is good and does good.\n\n\tGod is great and greatly to be praised.\n\n\tHis goodness is great\n\n\tAnd His greatness is good.\n\n\tHe was, is and ever will be.",
	"verse": "Mark 10:18",
	"versetext": "Jesus said to him,\n“Why do you call me good? No one is good except one—God.\n\n"
}, {
	"date": "1/15",
	"poem": "Pride of face, race and place,\n\n\tYour measure and treasure, cash and cargo,\n\n\tWhere you’ve been and where you’ll go,\n\n\tWhat you have learned, earned, accomplished and won,\n\n\tWithout grateful humility it all ends in disgrace and destruction.",
	"verse": "Pro. 16:18",
	"versetext": "Pride goes before destruction,\nand a haughty spirit before a fall.\n"
}, {
	"date": "1/16",
	"poem": "God, You are One and Trinity\n\n\tAll good, all true,\n\n\tIn all You are and do,\n\n\tThe only Divinity.",
	"verse": "Deu. 6:4",
	"versetext": "Hear, Israel: Yahweh is our God. Yahweh is one.\n"
}, {
	"date": "1/17",
	"poem": "Love is not taking but giving.\n\n\tIt is not possessing but losing for the beloved,\n\n\tDying so the other can go on living,\n\n\tGoing low to send them above.",
	"verse": "1John 4:10",
	"versetext": "In this is love, not that we loved God, but that he loved us, and sent his Son as the atoning sacrifice for our sins.\n"
}, {
	"date": "1/18",
	"poem": "Millennia ago Moses was inspired to write Psalm 90,\n\n\tLong before the start of modern medicine and scientific inquiry.\n\n\tIt states we only have 70 or 80 years until our ‘Date of Expiry.’\n\n\tAnd after so much time we still have the same limited life expectancy.\n\n\tBut our ‘Use by Date’ is only from sunrise and sunset.\n\n\tCount on it!",
	"verse": "Psa. 90:10",
	"versetext": "The days of our years are seventy,\nor even by reason of strength eighty years;\nyet their pride is but labor and sorrow,\nfor it passes quickly, and we fly away.\n"
}, {
	"date": "1/19",
	"poem": "Christ inquired, ‘can’t watch one hour?’\n\n\tAnd we must respond, ‘we can’t,’\n\n\tUnless you give us power\n\n\tAnd the help of Your Spirit.",
	"verse": "Rom. 8:26",
	"versetext": "In the same way, the Spirit also helps our weaknesses, for we don’t know how to pray as we ought. But the Spirit himself makes intercession for us with groanings which can’t be uttered.\n"
}, {
	"date": "1/20",
	"poem": "When you go to a new venue\n\n\tWhere no one knows you\n\n\tAnd you have no reputation,\n\n\tYou can give in to the anointing\n\n\tAnd pray and sing in the Spirit\n\n\tWith freedom and abandon\n\n\tNot caring who hears it.\n\n\tSo tonight, instead of a new location\n\n\tShout out, and get a transformation.",
	"verse": "Act. 4:31",
	"versetext": "When they had prayed, the place was shaken where they were gathered together. They were all filled with the Holy Spirit, and they spoke the word of God with boldness.\n"
}, {
	"date": "1/21",
	"poem": "On the flotsam and jetsam of death and destruction\n\n\tThe pure and peaceful dove could find no place to alight and stay\n\n\tUntil the Lamb of God, rising from His Water Baptism\n\n\tBecame the resting place from which she would never fly away.",
	"verse": "Gen. 8:9",
	"versetext": "but the dove found no place to rest her foot, and she returned into the ship to him, for the waters were on the surface of the whole earth. He put out his hand, and took her, and brought her to him into the ship.\n"
}, {
	"date": "1/22",
	"poem": "There is a yard where all is quiet and in order.\n\n\tNeighbors don’t dispute over property or borders,\n\n\tFamily fights and feuds have all ceased,\n\n\tEven politicians sleep together in peace.\n\n\tDon’t wait until you are in the cemetery\n\n\tTo live together in tranquility and harmony.",
	"verse": "Psa. 31:17",
	"versetext": "Let me not be disappointed, Yahweh, for I have called on you.\nLet the wicked be disappointed.\nLet them be silent in Sheol.\n"
}, {
	"date": "1/23",
	"poem": "Good Shepherd of men\n\n\tGive us Your grace and direction,\n\n\tProvision and protection.\n\n\tShow us how go out and come in,\n\n\tTo enter rest in Your heavenly habitation.",
	"verse": "Psa. 23:1",
	"versetext": "Yahweh is my shepherd:\nI shall lack nothing.\n"
}, {
	"date": "1/24",
	"poem": "Like with Levi there will come an occasion\n\n\tWhen you will have to make a painful decision.\n\n\tWith a sword in hand you will have to take a stand.\n\n\tWhose side will it be on, God or man?",
	"verse": "Ex. 32:26",
	"versetext": "then Moses stood in the gate of the camp, and said, “Whoever is on Yahweh’s side, come to me!”\nAll the sons of Levi gathered themselves together to him.\n"
}, {
	"date": "1/25",
	"poem": "A king cried out “who is on my side?”\n\n\tWho can resist that ageless spirit of seduction,\n\n\tIn the perfumed and painted Jezebel exemplified?\n\n\tOnly eunuchs could reject and eject that wicked woman.",
	"verse": "2Ki. 9:32",
	"versetext": "He lifted up his face to the window, and said, “Who is on my side? Who?”\nTwo or three eunuchs looked out at him.\n"
}, {
	"date": "1/26",
	"poem": "Made in Your image and likeness\n\n\tBody, Soul and Spirit our essence.\n\n\tLike You, three in one, a trinity,\n\n\tBecause You are the best way to be.",
	"verse": "Gen. 1:26",
	"versetext": "God said, “Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the birds of the sky, and over the livestock, and over all the earth, and over every creeping thing that creeps on the earth.”\n"
}, {
	"date": "1/27",
	"poem": "Created to be creative like Him.\n\n\tGiven authority and dominion,\n\n\tWe were made to multiply.\n\n\tYet many don’t even try.",
	"verse": "Gen. 1:27",
	"versetext": "God created man in his own image. In God’s image he created him; male and female he created them.\n"
}, {
	"date": "1/28",
	"poem": "Whom we preach, not a what,\n\n\tWhat we teach, not guessed, but got.\n\n\tTo everyone, not some,\n\n\tTo be perfect when He comes.",
	"verse": "Col. 1:28",
	"versetext": "whom we proclaim, admonishing every man and teaching every man in all wisdom, that we may present every man perfect in Christ Jesus;\n"
}, {
	"date": "1/29",
	"poem": "We work out what He has worked in.\n\n\tStraining, struggling and striving\n\n\tAccording to His working that always wins\n\n\tAnd always accomplishes what it begins.",
	"verse": "Col. 1:29",
	"versetext": "for which I also labor, striving according to his working, which works in me mightily.\n"
}, {
	"date": "1/30",
	"poem": "Like motes of dust dancing in a light ray,\n\n\tUnseen breath lifting it ever more upward,\n\n\tWe are looking for that glorious day\n\n\tWhen to our Maker we are raptured.",
	"verse": "1Th. 4:16",
	"versetext": "For the Lord himself will descend from heaven with a shout, with the voice of the archangel, and with God’s trumpet. The dead in Christ will rise first,\n"
}, {
	"date": "1/31",
	"poem": "Ever and all glorious Lord\n\n\tWho all creation holds\n\nIn Your infinite embrace.\n\n\tMy heart and soul mold\n\n\tAnd my spirit enfold\n\n\tUntil this clay displays Your face.",
	"verse": "2Cor. 4:7",
	"versetext": "But we have this treasure in clay vessels, that the exceeding greatness of the power may be of God, and not from ourselves.\n"
}, {
	"date": "2/1",
	"poem": "The Blood of Jesus,\n\n\tSo precious to us!",
	"verse": "1Pet. 1:19",
	"versetext": "but with precious blood, as of a lamb without blemish or spot, the blood of Christ;\n"
}, {
	"date": "2/2",
	"poem": "Your polished leather Bible cover may shine\n\n\tWith edges gilt and ribbons ironed,\n\n\tBut it is the light inside that shows\n\n\tThe beauty of God’s written gems and gold.",
	"verse": "Titus 2:10",
	"versetext": "not stealing, but showing all good fidelity; that they may adorn the doctrine of God, our Savior, in all things.\n"
}, {
	"date": "2/3",
	"poem": "Let there be a transforming and lasting revelation.\n\n\tRevival is not just noise and perspiration,\n\n\tBut the Spirit making a holy change within.\n\n\tHow often after singing and dancing ends\n\n\tDoes the sin begin again?",
	"verse": "Ps. 80:18",
	"versetext": "So we will not turn away from you.\nRevive us, and we will call on your name.\n"
}, {
	"date": "2/4",
	"poem": "Just ones shall live by faith,\n\n\tNeither hurried nor in haste,\n\n\tNot worried or withdrawn,\n\n\tWaiting, while they carry on.",
	"verse": "Heb. 10:38",
	"versetext": "But the righteous will live by faith.\nIf he shrinks back, my soul has no pleasure in him.”\n"
}, {
	"date": "2/5",
	"poem": "You must resist sickness\n\n\tBy His strength and righteousness.\n\n\tYou must not give in to death.\n\n\tGod is not finished using you yet.",
	"verse": "Isa. 38:16",
	"versetext": "Lord, men live by these things;\nand my spirit finds life in all of them:\nyou restore me, and cause me to live.\n"
}, {
	"date": "2/6",
	"poem": "Being gravely ill is like taking a terrible trip,\n\n\tOr voyaging on a tempest-tossed ship.\n\n\tIt threatens to end in disaster and injury\n\n\tBut Jesus brings us through to health and victory.",
	"verse": "John 11:4",
	"versetext": "But when Jesus heard it, he said,\n“This sickness is not to death, but for the glory of God, that God’s Son may be glorified by it.”\n"
}, {
	"date": "2/7",
	"poem": "We are hand made by God,\n\nClean clay, creative sod,\n\n\tUp thrust dust, standing soil;\n\n\tBut by His breath, an eternal soul.",
	"verse": "Gen. 2:7",
	"versetext": "Yahweh God formed man from the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul.\n"
}, {
	"date": "2/8",
	"poem": "Stop running and soar.\n\n\tWait on God and you can do more.",
	"verse": "Isa. 40:31",
	"versetext": "But those who wait for Yahweh will renew their strength.\nThey will mount up with wings like eagles.\nThey will run, and not be weary.\nThey will walk, and not faint.\n"
}, {
	"date": "2/9",
	"poem": "We were made in His image and likeness,\n\n\tInspired to be creative like Him.\n\n\tBut like our breath, the resemblance is within.\n\n\tDon’t stay stuck in the muck and clay.\n\n\tRise up from the earth and dust,\n\n\tAnd do something new and unique today.",
	"verse": "Gen. 1:27",
	"versetext": "God created man in his own image. In God’s image he created him; male and female he created them.\n"
}, {
	"date": "2/10",
	"poem": "As in those early days of destiny,\n\n\tWhen you first heard His call\n\n\tWhich you answered in humility,\n\n\tDo you still feel purpose and challenge?\n\nMaybe once more you can forsake all\n\nTake up your cross and follow Him again.",
	"verse": "Mat. 16:24",
	"versetext": "Then Jesus said to his disciples,\n“If anyone desires to come after me, let him deny himself, and take up his cross, and follow me.\n\n"
}, {
	"date": "2/11",
	"poem": "Did your first love last,\n\n\tOr is it in the past?\n\n\tIt may have been left,\n\n\tBut it is not lost.\n\n\tFind it at the foot of the Cross.",
	"verse": "Rev. 2:4",
	"versetext": "\nBut I have this against you, that you left your first love.\n\n"
}, {
	"date": "2/12",
	"poem": "Your first works were done when your faith was young.\n\n\tYou didn’t lead singing or even know the words of a song.\n\nYou couldn’t preach, find verses or offer Biblical proof.\n\n\tYou could only believe, receive and worship in spirit and truth.",
	"verse": "Rev. 2:5",
	"versetext": "\nRemember therefore from where you have fallen, and repent and do the first works; or else I am coming to you swiftly, and will move your lamp stand out of its place, unless you repent.\n\n"
}, {
	"date": "2/13",
	"poem": "Binding His donkey’s foal and colt to a vine\n\n\tThe Lion of Judah washed His garments in wine.\n\n\tThough our sins have stained us scarlet\n\n\tWashing with Jesus’ blood will remove it.",
	"verse": "Gen. 49:11",
	"versetext": "Binding his foal to the vine,\nhis donkey’s colt to the choice vine;\nhe has washed his garments in wine,\nhis robes in the blood of grapes.\n"
}, {
	"date": "2/14",
	"poem": "Some wounds we cannot see\n\n\tLike a bruise which is blood under skin,\n\n\tOr a heart broken deeply within.\n\n\tChrist suffered these for you and me.\n\n\tHe was wounded for our sin\n\n\tAnd bruised for our iniquity.",
	"verse": "Isa. 53:5",
	"versetext": "But he was pierced for our transgressions.\nHe was crushed for our iniquities.\nThe punishment that brought our peace was on him;\nand by his wounds we are healed.\n"
}, {
	"date": "2/15",
	"poem": "When you let God be the boss\n\n\tDeath on a cross is not loss.\n\n\tSo say like Jesus did, ‘not my will be done’\n\n\tThen, even when you lose, you have won.",
	"verse": "Mat. 26:42",
	"versetext": "Again, a second time he went away, and prayed, saying,\n“My Father, if this cup can’t pass away from me unless I drink it, your desire be done.”\n\n"
}, {
	"date": "2/16",
	"poem": "The tomb is not a door to doom\n\n\tBut a changing room\n\n\tWhere we leave these clothes of clay\n\n\tTo put on our bridal array.",
	"verse": "2Cor. 5:3",
	"versetext": "if so be that being clothed we will not be found naked.\n"
}, {
	"date": "2/17",
	"poem": "Some say they cannot fast and pray\n\n\tOr watch through a whole night.\n\n\tBut they won’t know until they try it.\n\n\tIf you succeed it is through His ability.\n\n\tIf you fail, then it is God’s responsibility",
	"verse": "Jas. 4:2",
	"versetext": "You lust, and don’t have. You murder and covet, and can’t obtain. You fight and make war. You don’t have, because you don’t ask.\n"
}, {
	"date": "2/18",
	"poem": "Do you love your laptop more than your Bible?\n\n\tHas your phone and tablet become a habit?\n\n\tAre you dependent on the internet?\n\n\tNot all addictions are chemical. Some are digital.\n\n\tBetter take a break and break the attachments\n\n\tBefore they connect you to a funeral.",
	"verse": "1John 2:15",
	"versetext": "Don’t love the world or the things that are in the world. If anyone loves the world, the Father’s love isn’t in him.\n"
}, {
	"date": "2/19",
	"poem": "Just Salvation,\n\n\tBeing Born Again,\n\n\tAnd having the lowest place in Heaven,\n\n\tWould be enough for us to praise Him without end.",
	"verse": "1Ti. 1:15",
	"versetext": "The saying is faithful and worthy of all acceptance, that Christ Jesus came into the world to save sinners; of whom I am chief.\n"
}, {
	"date": "2/20",
	"poem": "It is a mystery\n\n\tThat when we surrender\n\n\tTo our strong Defender\n\n\tWe get the victory.",
	"verse": "Ex. 14:14",
	"versetext": "Yahweh will fight for you, and you shall be still.”\n"
}, {
	"date": "2/21",
	"poem": "Surrender to God is not abrogation of self,\n\n\tOr an abolition of our autonomy.\n\n\tWhat we thought was independence\n\n\tWas actually bondage to sin and selfishness.\n\n\tSo submission to Jesus\n\n\tBecause we do it willingly,\n\n\tMakes our liberty precious,\n\n\tAnd our freedom more free.",
	"verse": "Rom. 6:18",
	"versetext": "Being made free from sin, you became bondservants of righteousness.\n"
}, {
	"date": "2/22",
	"poem": "Uncreated Creator of light and life\n\n\tMake your Church into the Last Adam’s wife.",
	"verse": "Gen. 2:22",
	"versetext": "Yahweh God made a woman from the rib which he had taken from the man, and brought her to the man.\n"
}, {
	"date": "2/23",
	"poem": "When young, our lusts are stronger than us.\n\n\tYour desires have grown but not your experience.\n\n\tThey can cause you to lose your inheritance.\n\n\tSo when you feel temptation come\n\n\tYou better run.\n\n\tPut between you and it some distance.",
	"verse": "2Tim. 2:22",
	"versetext": "Flee from youthful lusts; but pursue righteousness, faith, love, and peace with those who call on the Lord out of a pure heart.\n"
}, {
	"date": "2/24",
	"poem": "In these modern days\n\n\tWith everything instantaneous\n\n\tSeeking God is extraneous.\n\n\tPreachers have modern ways\n\n\tTo prepare their messages.\n\n\tThey can dive into a hard drive\n\n\tFor some leftovers to revive,\n\n\tOr rehydrate if freeze dried.\n\n\tThey find it cold and old on the Internet\n\n\tThen reheat or microwave it,\n\n\tEven though it had long died.\n\n\tHow about instead of stealing sermons,\n\n\tWe wait on God for them?",
	"verse": "Hab. 2:1",
	"versetext": "I will stand at my watch, and set myself on the ramparts, and will look out to see what he will say to me, and what I will answer concerning my complaint.\n"
}, {
	"date": "2/25",
	"poem": "Jesus did it daily and prayed it three times,\n\n\tNot my will but Thine.\n\n\tSo let Him lead moment by moment\n\n\tAnd you won’t be a disappointment.",
	"verse": "Lk. 22:42",
	"versetext": "saying,\n“Father, if you are willing, remove this cup from me. Nevertheless, not my will, but yours, be done.”\n"
}, {
	"date": "2/26",
	"poem": "Whether we build with gold or grass,\n\n\tThrough the fire it will have to pass.\n\n\tThe chaff in a flash just turns to smoke and ash\n\n\tBut the gold only becomes more pure and precious.",
	"verse": "1Cor. 3:13",
	"versetext": "each man’s work will be revealed. For the Day will declare it, because it is revealed in fire; and the fire itself will test what sort of work each man’s work is.\n"
}, {
	"date": "2/27",
	"poem": "Proud people seek position and power,\n\n\tThe humble thirst for holiness and Him\n\n\tWho humbled Himself lower and lower\n\n\tUntil God raised Him to the height of heaven.",
	"verse": "Php. 2:8",
	"versetext": "And being found in human form, he humbled himself, becoming obedient to death, yes, the death of the cross.\n"
}, {
	"date": "2/28",
	"poem": "“He gives His beloved sleep”\n\n\tA verse used when feeling tired and weak.\n\n\tBut more often when stuck in bed,\n\n\tLazy, slothful and spiritually dead.",
	"verse": "Psa. 127:2",
	"versetext": "It is vain for you to rise up early,\nto stay up late,\neating the bread of toil;\nfor he gives sleep to his loved ones.\n"
}, {
	"date": "3/1",
	"poem": "Even if it’s too early, get up and about!\n\n\tEven if it’s too late, rise, get out!\n\n\tNot just an alarm, but all creation rings.\n\n\tNot just birds, but stars and angels sing.\n\n\tIf you don’t do it, the sleeping stones may shout.",
	"verse": "Psa. 92:2",
	"versetext": "to proclaim your loving kindness in the morning,\nand your faithfulness every night,\n"
}, {
	"date": "3/2",
	"poem": "Don’t give your Old Man any mind\n\n\tOr it will drag you down to earth over time.\n\n\tLove those things above, hidden in Heaven,\n\n\tWhere Christ enthroned is waiting to reign\n\n\tBeside His Bride who overcame in the world below\n\n\tAnd stayed always watching and ready to go.",
	"verse": "Col. 3:2",
	"versetext": "Set your mind on the things that are above, not on the things that are on the earth.\n"
}, {
	"date": "3/3",
	"poem": "Don’t let this make you afraid\n\n\tBut the Lord has already seen your grave.\n\n\tOn every calendar is the date of your last day.\n\n\tDon’t despair, the date of the Rapture is also there.\n\n\tYour times are in His Hand\n\n\tAnd so is your Resurrection.",
	"verse": "Psa. 31:15",
	"versetext": "My times are in your hand.\nDeliver me from the hand of my enemies, and from those who persecute me.\n"
}, {
	"date": "3/4",
	"poem": "Acting is a terrible profession\n\n\tOften it ends in demonic possession.\n\n\tBecause they make a living out of living a lie,\n\n\tActors often commit suicide or overdose and die.\n\n\tDon’t be seduced by society’s standard of fortune and fame,\n\n\tMost of those adored acting idols and stars end in shame.",
	"verse": "Mal. 3:15",
	"versetext": "Now we call the proud happy; yes, those who work wickedness are built up; yes, they tempt God, and escape.’\n"
}, {
	"date": "3/5",
	"poem": "Even angels and seraphim cover their faces and feet.\n\n\tIt is not that all are so dirty, ugly and lowly.\n\n\tBut that our lovely Lord is so high, and lofty and holy.\n\n\tOne day the veil and curtain of death will part\n\n\tAnd we see Him with open face and heart.",
	"verse": "Isa. 25:7",
	"versetext": "He will destroy in this mountain the surface of the covering that covers all peoples, and the veil that is spread over all nations.\n"
}, {
	"date": "3/6",
	"poem": "There was a rich poor man, always so sad.\n\n\tHe was never glad for all the gifts from God he had.\n\n\tAs he lived, breathed, drank and saw light for free,\n\n\tHe continually complained of his poverty.\n\n\tLet us give thanks to God continually\n\n\tFor all He bestows upon us so richly.",
	"verse": "1Tim. 6:17",
	"versetext": "Charge those who are rich in this present world that they not be haughty, nor have their hope set on the uncertainty of riches, but on the living God, who richly provides us with everything to enjoy;\n"
}, {
	"date": "3/7",
	"poem": "One way you can know that God is true\n\n\tIs when He makes something new and good through you.\n\n\tYou will experience evidence of His presence and grace.\n\n\tWhen you allow Him to inspire and equip you to create.",
	"verse": "1Cor. 15:10",
	"versetext": "But by the grace of God I am what I am. His grace which was given to me was not futile, but I worked more than all of them; yet not I, but the grace of God which was with me.\n"
}, {
	"date": "3/8",
	"poem": "On the Holy Highway to Zion\n\n\tThe lowest and lamest of men,\n\n\tEven the wayward fool, will not fail or fall\n\n\tUntil God has fulfilled His purpose in all.",
	"verse": "Isa. 35:8",
	"versetext": "A highway will be there, a road,\nand it will be called The Holy Way.\nThe unclean shall not pass over it,\nbut it will be for those who walk in the Way.\nWicked fools will not go there.\n"
}, {
	"date": "3/9",
	"poem": "When we travail, and make intercession\n\n\tWe give strength and support to our brethren\n\n\tWho are too weary, weak and broken.\n\n\tWorn out ourselves and ignorant of their problems\n\n\tWe send them strength and wisdom to solve them.\n\n\tHoly Spirit help us utter prayers that can’t be spoken.",
	"verse": "Rom. 8:26",
	"versetext": "In the same way, the Spirit also helps our weaknesses, for we don’t know how to pray as we ought. But the Spirit himself makes intercession for us with groanings which can’t be uttered.\n"
}, {
	"date": "3/10",
	"poem": "Whatever good works you may do,\n\n\tAnd may there be many of them,\n\n\tThey will never be enough to make God take you back again,\n\n\tThat price was fully paid when He gave His Son for your sin.",
	"verse": "Psa. 49:8",
	"versetext": "For the redemption of their life is costly,\nno payment is ever enough,\n"
}, {
	"date": "3/11",
	"poem": "Some appear so weak, harsh and sour\n\n\tAs they preach about God’s joyous power,\n\n\tTeaching of fellowship and love for others\n\n\tAs they judge, reject and condemn their brothers.",
	"verse": "Col. 4:5",
	"versetext": "Walk in wisdom toward those who are outside, redeeming the time.\n"
}, {
	"date": "3/12",
	"poem": "Others are so exclusive, selective and hard-shelled\n\n\tThey make it hard to get in heaven and easy to enter hell.\n\n\tSuch messengers make lost sinners ask themselves the question\n\n\tIf the exemplars of Zion and inhabitants of heaven are so\n\n\tI am not sure such a paradise is a place I would want to go.",
	"verse": "Col. 4:6",
	"versetext": "Let your speech always be with grace, seasoned with salt, that you may know how you ought to answer each one.\n"
}, {
	"date": "3/13",
	"poem": "Everything the Devil caused to be cursed\n\n\tJesus redeemed, restored and blest.\n\n\tHe sweat blood on the cursed earth\n\n\tTo give us fruitfulness and rest.\n\n\tHe saw His Seed and travail in our New Birth.",
	"verse": "Gal. 3:13",
	"versetext": "Christ redeemed us from the curse of the law, having become a curse for us. For it is written, “Cursed is everyone who hangs on a tree,”\n"
}, {
	"date": "3/14",
	"poem": "From the cursed ground\n\n\tThorns became a crown.\n\n\tJesus did not take down from a tree as Adam\n\n\tOr use them to hide behind and cover up sin\n\n\tBut was publicly nailed up naked on one.",
	"verse": "Gen. 3:18",
	"versetext": "It will yield thorns and thistles to you;\nand you will eat the herb of the field.\n"
}, {
	"date": "3/15",
	"poem": "The first man hid from the presence of God in a garden,\n\n\tBut at Calvary the Father hid His face from the Son.\n\n\tJesus willingly took on the lowest and most abased form,\n\n\tBeing made like unto a slain serpent and crushed worm.\n\n\tHe did not blame others, but forgave with last His breaths.\n\n\tHe took our sin in His sinless body, by dying He destroyed death.",
	"verse": "Gen. 3:8",
	"versetext": "They heard Yahweh God’s voice walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of Yahweh God among the trees of the garden.\n"
}, {
	"date": "3/16",
	"poem": "God so loved, so He gave and gave and gave\n\n\tHis only Son through a womb, a cross and a grave,\n\n\tTo descend under the earth and ascend above it too,\n\n\tTo accomplish what no one else could do.\n\n\tTo possess the keys of Hell and death,\n\n\tSo His beloved would not perish, but be forever saved.",
	"verse": "John 3:16",
	"versetext": "\nFor God so loved the world, that he gave his one and only Son, that whoever believes in him should not perish, but have eternal life.\n\n"
}, {
	"date": "3/17",
	"poem": "The jewels of Jesus\n\n\tAdorning His Church and crown\n\n\tAnd that Holy City coming down\n\n\tWere first found hidden deep within the dark and dirty ground.\n\n\tThough we once were captives, His inheritance and treasure is in us.",
	"verse": "Mal. 3:17",
	"versetext": "They shall be mine,” says Yahweh of Armies, “my own possession in the day that I make, and I will spare them, as a man spares his own son who serves him.\n"
}, {
	"date": "3/18",
	"poem": "Enthroned incandescent within that transparent city\n\n\tOur King of kings blazes brilliantly throughout eternity.\n\n\tThere we will reflect, refract, mirror, magnify and display His glory\n\n\tWithout spot, stain, fault or flaw for all creation to see.",
	"verse": "Rev. 21:11",
	"versetext": "having the glory of God. Her light was like a most precious stone, as if it were a jasper stone, clear as crystal;\n"
}, {
	"date": "3/19",
	"poem": "If you hear I die, don’t cry.\n\n\tKeep your eyes lifted and dry.\n\n\tI plan to miss my funeral and fly\n\n\tAnd be laughing and dancing on high.",
	"verse": "Php. 1:23",
	"versetext": "But I am in a dilemma between the two, having the desire to depart and be with Christ, which is far better.\n"
}, {
	"date": "3/20",
	"poem": "There is poetry in you too\n\n\tTomorrow’s is for you to do.\n\n\tSo by His grace\n\n\tFill every empty space\n\n\tWith songs and poems of praise",
	"verse": "Psa. 45:1",
	"versetext": "My heart overflows with a noble theme.\nI recite my verses for the king.\nMy tongue is like the pen of a skillful writer.\n"
}, {
	"date": "3/21",
	"poem": "For God so loved the world that he gave his only begotten son",
	"verse": "John 3:16",
	"versetext": "\nFor God so loved the world, that he gave his one and only Son, that whoever believes in him should not perish, but have eternal life.\n\n"
}, {
	"date": "3/22",
	"poem": "Whatever the couture\n\n\tTo the folks in the future\n\n\tWe are already way out of style.\n\n\tChasing after change is futile.\n\n\tNo matter how much it cost\n\n\tThe prize is always and already lost.",
	"verse": "Isa. 3:22",
	"versetext": "the fine robes, the capes, the cloaks, the purses,\n"
}, {
	"date": "3/23",
	"poem": "If you would gaze more and more each day\n\n\tInto the glass of God’s Word and stay\n\n\tMindful of the face of Jesus there\n\n\tYou will be transformed forever",
	"verse": "James 1:23",
	"versetext": "For if anyone is a hearer of the word and not a doer, he is like a man looking at his natural face in a mirror;\n"
}, {
	"date": "3/24",
	"poem": "Pay no attention to the time.\n\n\tLook to the Son, not the sun.\n\n\tLook to His face, not your watch’s\n\n\tWatch His hands, not the clock’s.\n\n\tListen for His call, not the phone’s.",
	"verse": "Hos. 10:12",
	"versetext": "Sow to yourselves in righteousness,\nreap according to kindness.\nBreak up your fallow ground;\nfor it is time to seek Yahweh,\nuntil he comes and rains righteousness on you.\n"
}, {
	"date": "3/25",
	"poem": "Not just in a dry, desolate desert\n\n\tBut more in a well-watered garden,\n\n\tWhere all is comfortable and pleasant,\n\n\tIs the place where our hearts are dulled and hardened\n\n\tAnd we forget the One who enriched and blest us.",
	"verse": "Gen. 13:10",
	"versetext": "Lot lifted up his eyes, and saw all the plain of the Jordan, that it was well-watered everywhere, before Yahweh destroyed Sodom and Gomorrah, like the garden of Yahweh, like the land of Egypt, as you go to Zoar.\n"
}, {
	"date": "3/26",
	"poem": "Like that offering,\n\n\tHe consumed our sin\n\n\tAnd drank to the dregs\n\n\tThat cursed cup of death\n\n\tSo we could be cleansed,\n\n\tDelivered and born again.",
	"verse": "Lev. 6:26",
	"versetext": "The priest who offers it for sin shall eat it. It shall be eaten in a holy place, in the court of the Tent of Meeting.\n"
}, {
	"date": "3/27",
	"poem": "Either caught up or captured down\n\n\tWe all are going to disappear,\n\n\tHidden by clouds or by ground.\n\n\tIn the earth or in the air.",
	"verse": "1Th. 4:17",
	"versetext": "then we who are alive, who are left, will be caught up together with them in the clouds, to meet the Lord in the air. So we will be with the Lord forever.\n"
}, {
	"date": "3/28",
	"poem": "His unselfish sacrifice\n\n\tGave us eternal life.",
	"verse": "Tit. 2:14",
	"versetext": "who gave himself for us, that he might redeem us from all iniquity, and purify for himself a people for his own possession, zealous for good works.\n"
}, {
	"date": "3/29",
	"poem": "Between earth and sky\n\n\tHe was nailed to die.\n\n\tEntombed, yet after three days, out.\n\n\tComing again, soon, with a secret shout!",
	"verse": "Mark 15:25",
	"versetext": "It was the third hour,\n and they crucified him.\n"
}, {
	"date": "3/30",
	"poem": "Passover, pass over me and my family\n\n\tLike the roof above our home\n\n\tThat bears the beatings from sun and storm,\n\n\tShelter us from the terrors of night or day.\n\n\tHide us from the accuser’s prying eyes.\n\n\tMake the destroyer pass over us and stay away,\n\n\tNever coming inside so that none within ever dies.\n\n\tForever we will abide under Your love and grace\n\n\tThat covers us in this place, and for all eternity.",
	"verse": "1Cor. 5:7",
	"versetext": "Purge out the old yeast, that you may be a new lump, even as you are unleavened. For indeed Christ, our Passover, has been sacrificed in our place.\n"
}, {
	"date": "3/31",
	"poem": "The tomb is not locked anymore.\n\n\tHell and Death cannot keep us bound\n\n\tBecause Jesus Christ descended down,\n\n\tCollected their keys to set us free,\n\n\tAnd risen, opened the doors.",
	"verse": "Rev. 1:18",
	"versetext": "\nand the Living one. I was dead, and behold, I am alive forever and ever. Amen. I have the keys of Death and of Hades.\n"
}, {
	"date": "4/1",
	"poem": "Every time we take Communion\n\n\tWe remember and show His crucifixion.\n\n\tBut also, Jesus’ resurrection,\n\n\tAnd that He is coming back again.",
	"verse": "1Cor. 11:26",
	"versetext": "For as often as you eat this bread and drink this cup, you proclaim the Lord’s death until he comes.\n"
}, {
	"date": "4/2",
	"poem": "Some have their consciences seared as with fire,\n\n\tLike skin burnt and scarred by a red-hot iron.\n\n\tOthers are as a team who refuse to hear the umpire.\n\n\tThese dangerous last days will be filled with hypocritical liars\n\n\tAnd doctrines and ideas inspired by demons.",
	"verse": "1Tim. 4:2",
	"versetext": "through the hypocrisy of men who speak lies, branded in their own conscience as with a hot iron;\n"
}, {
	"date": "4/3",
	"poem": "I must humble myself and bow low.\n\n\tI fall to the earth facedown\n\n\tWhere many feet have tread,\n\n\tEven some of who are now dead\n\n\tAnd returned to the ground,\n\n\tUnmoving and immobile below.\n\n\tStill more I humble myself, and go as low as I can.\n\n\tI repent again and again and again,\n\n\tTrusting You to raise me from here to the heights of heaven.",
	"verse": "2Ch. 34:27",
	"versetext": "because your heart was tender, and you humbled yourself before God, when you heard his words against this place, and against its inhabitants, and have humbled yourself before me, and have torn your clothes, and wept before me, I also have heard you,” says Yahweh.\n"
}, {
	"date": "4/4",
	"poem": "This evening, as you stand strong and upright\n\n\tOr lay awake staring up at the ceiling,\n\n\tRemember there are many past healing\n\n\tWho sleep outside under soil and sod\n\n\tWith the rain or stars in their face,\n\n\tBut they can’t leave their place.\n\n\tSo get moving and doing something for God,\n\n\tBecause you still have life and breath left tonight.",
	"verse": "Eph. 5:14",
	"versetext": "Therefore he says, “Awake, you who sleep, and arise from the dead, and Christ will shine on you.”\n"
}, {
	"date": "4/5",
	"poem": "Lord of the Sabbath\n\n\tYou are also Lord of Sabaoth.\n\n\tOh Lord of Hosts,\n\n\tFill us with Your Holy Ghost.\n\n\tThen we will win the war while we rest.",
	"verse": "Rom. 9:29",
	"versetext": "As Isaiah has said before,\n“Unless the Lord of Armies had left us a seed,\nwe would have become like Sodom,\nand would have been made like Gomorrah.”\n"
}, {
	"date": "4/6",
	"poem": "Let’s live like we are young and innocent once again,\n\n\tWhen we had no name or reputation to pretend and defend.\n\n\tWe recognized no sins, faults or failures in others.\n\n\tNo matter what shape or color, we played as brothers.\n\n\tSo in understanding be men.\n\n\tIn evil, be as little children.",
	"verse": "1Cor. 14:20",
	"versetext": "Brothers, don’t be children in thoughts, yet in malice be babies, but in thoughts be mature.\n"
}, {
	"date": "4/7",
	"poem": "Suppose all your lusts and desires were instantly gratified,\n\n\tLike that surfeit of quail that ran out of the mob’s noses.\n\n\tWe would learn that being satiated here below never satisfies.\n\n\tThat only happens above at His table and cup that overflows.",
	"verse": "Psa. 106:15",
	"versetext": "He gave them their request,\nbut sent leanness into their soul.\n"
}, {
	"date": "4/8",
	"poem": "There is no challenge in loving those with whom we agree\n\n\tWho are like us, and like us, and are in our family tree.\n\n\tThose different are easy to despise.\n\n\tBut since to the same Savior and heaven we rise,\n\n\tLet us love and see all through our Father’s eyes.",
	"verse": "1John 4:11",
	"versetext": "Beloved, if God loved us in this way, we also ought to love one another.\n"
}, {
	"date": "4/9",
	"poem": "Because these are the Last Days\n\nWe will see a great falling away.\n\n\tSin and backsliding will increase\n\n\tAnd the faith of many decrease.\n\n\tLittle Flock,\n\n\tFear not.",
	"verse": "Lk. 12:32",
	"versetext": "\nDon’t be afraid, little flock, for it is your Father’s good pleasure to give you the Kingdom.\n\n"
}, {
	"date": "4/10",
	"poem": "Upon Your finished work I rest.\n\n\tI know that there will be a test.\n\n\tBut on Calvary’s cross all was done,\n\n\tSo, through You, before I start, I’ve won.",
	"verse": "Heb. 4:10",
	"versetext": "For he who has entered into his rest has himself also rested from his works, as God did from his.\n"
}, {
	"date": "4/11",
	"poem": "We trust You, and will not be shaken.\n\n\tWhen You return we will be taken.",
	"verse": "Heb. 12:28",
	"versetext": "Therefore, receiving a Kingdom that can’t be shaken, let us have grace, through which we serve God acceptably, with reverence and awe,\n"
}, {
	"date": "4/12",
	"poem": "When you teach others,\n\n\tYou learn more than they do.\n\n\tLike that scribe with the Scriptures\n\n\tYou will bring out treasures\n\n\tFrom the Bible, both old and new.",
	"verse": "Mat. 13:52",
	"versetext": "He said to them,\n“Therefore every scribe who has been made a disciple in the Kingdom of Heaven is like a man who is a householder, who brings out of his treasure new and old things.”\n"
}, {
	"date": "4/13",
	"poem": "Throughout my life I have been a wayfaring fool.\n\n\tI now bow face down in worship and reverence\n\n\tAnd fall in awe at Your feet\n\n\tWhere heaven and earth meet,\n\n\tWhere at Your heel the Devil met defeat.\n\n\tFrom now on I want to be Your resting place,\n\n\tA lowly, faithful and firm footstool.",
	"verse": "Heb. 1:13",
	"versetext": "But which of the angels has he told at any time,\n“Sit at my right hand,\nuntil I make your enemies the footstool of your feet?”\n"
}, {
	"date": "4/14",
	"poem": "You will be richer today\n\n\tIf you give all away.",
	"verse": "Lk. 18:22",
	"versetext": "When Jesus heard these things, he said to him,\n“You still lack one thing. Sell all that you have, and distribute it to the poor. You will have treasure in heaven. Come, follow me.”\n"
}, {
	"date": "4/15",
	"poem": "When it seems storms of sin will overwhelm us,\n\n\tAnd an avalanche of temptation descends too strong to resist\n\n\tCome shelter within Christ’s blood and wounds,\n\n\tAnd rest while the tempests and tremors flow past.",
	"verse": "Isa. 32:2",
	"versetext": "A man shall be as a hiding place from the wind,\nand a covert from the storm,\nas streams of water in a dry place,\nas the shade of a large rock in a weary land.\n"
}, {
	"date": "4/16",
	"poem": "There is a tunnel through the skies and trees\n\n\tGoing up through clouds or leaves.\n\n\tIt makes this material world seem a funnel\n\n\tThrough which we are taken up, whether we live or lay.\n\n\tIt is near to wherever you are, or may go, or stay.\n\n\tAny moment you might go through it and leave\n\n\tTo pour up to Him Who opened the way\n\n\tAnd is the life and light at the end of the tunnel.",
	"verse": "1Cor. 15:52",
	"versetext": "in a moment, in the twinkling of an eye, at the last trumpet. For the trumpet will sound, and the dead will be raised incorruptible, and we will be changed.\n"
}, {
	"date": "4/17",
	"poem": "This modern digital age is\n\n\tFlooded with tsunamis of webpages,\n\n\tAnd so many sites and channels to choose from.\n\n\tYet all that data saves no one, and will be unsaved.\n\n\tIt just fills up men’s time until they fill up their graves.",
	"verse": "1Cor. 7:31",
	"versetext": "and those who use the world, as not using it to the fullest. For the mode of this world passes away.\n"
}, {
	"date": "4/18",
	"poem": "As we continue to believe\n\n\tWe continue to receive\n\n\tBrighter and brighter illumination\n\n\tAnd more and more revelation.\n\n\tOur path to perfect day becomes more clear\n\n\tUntil we are caught up to a place where\n\n\tThere is no need for sun or lamp there.",
	"verse": "Pro. 4:18",
	"versetext": "But the path of the righteous is like the dawning light,\nthat shines more and more until the perfect day.\n"
}, {
	"date": "4/19",
	"poem": "Some look forward to death as an escape to rest in peace,\n\n\tThinking the grave is where all toils and sorrows cease.\n\n\tBut it is only those who have already entered rest in this life\n\n\tThat find eternal rest through faith in the finished work of Christ.",
	"verse": "Heb. 4:3",
	"versetext": "For we who have believed do enter into that rest, even as he has said, “As I swore in my wrath, they will not enter into my rest”; although the works were finished from the foundation of the world.\n"
}, {
	"date": "4/20",
	"poem": "If God feels far away\n\n\tRealize that He did not move.\n\n\tCome back to your first love\n\n\tAnd stay.",
	"verse": "Revelation 2:4",
	"versetext": "\nBut I have this against you, that you left your first love.\n\n"
}, {
	"date": "4/21",
	"poem": "Oh Most Lofty, yet most humble,\n\n\tYou are so, so, so high and holy.\n\n\tYou inhabit eternity, still You dwell with the lowly.\n\n\tYou bend and rise to deliver and conquer me.",
	"verse": "Psa. 18:35",
	"versetext": "You have also given me the shield of your salvation.\nYour right hand sustains me.\nYour gentleness has made me great.\n"
}, {
	"date": "4/22",
	"poem": "Each day in every way\n\n\tI put my old man and mind away.\n\n\tLet only and always,\n\n\tOnly Your new man stay.",
	"verse": "Eph. 4:22",
	"versetext": "that you put away, as concerning your former way of life, the old man, that grows corrupt after the lusts of deceit;\n"
}, {
	"date": "4/23",
	"poem": "The Devil will provide a way for us to escape the cross.\n\n\tIf we take it, we become a stumbling and roadblock.\n\n\tThose generations following us would be lost,\n\n\tAnd our graves and Heaven’s entrance remain locked.",
	"verse": "Mat. 26:39",
	"versetext": "He went forward a little, fell on his face, and prayed, saying,\n“My Father, if it is possible, let this cup pass away from me; nevertheless, not what I desire, but what you desire.”\n"
}, {
	"date": "4/24",
	"poem": "Instead of faces stuck in Facebook\n\n\tAll will one day will have to face\n\n\tThat inerasable hard drive,\n\nThe opened books of their lives,\n\nInto which all in eternity will look\n\nWith no place, no space for us to hide.",
	"verse": "Revelation 20:12",
	"versetext": "I saw the dead, the great and the small, standing before the throne, and they opened books. Another book was opened, which is the book of life. The dead were judged out of the things which were written in the books, according to their works.\n"
}, {
	"date": "4/25",
	"poem": "When we are gathered under His ensign\n\n\tFrom every tribe, tongue and nation,\n\n\tEvery angel and all of creation\n\n\tWill see the risen Root of Jesse\n\n\tResting in His glorious victory.",
	"verse": "Isa. 11:10",
	"versetext": "It will happen in that day that the nations will seek the root of Jesse, who stands as a banner of the peoples; and his resting place will be glorious.\n"
}, {
	"date": "4/26",
	"poem": "God is light, but light is not Him.\n\n\tYet even natural illumination\n\n\tIs beyond human comprehension.\n\n\tWe can only know God by revelation.",
	"verse": "Psa. 36:9",
	"versetext": "For with you is the spring of life.\nIn your light shall we see light.\n"
}, {
	"date": "4/27",
	"poem": "In a garden that would soon become Jesus’ grave\n\n\tGod heard His Beloved Son’s strong crying.\n\n\tThere Jesus denied His own will, so we could be saved,\n\n\tAnd the Son was saved from spiritual death by dying.",
	"verse": "Heb. 5:7",
	"versetext": "He, in the days of his flesh, having offered up prayers and petitions with strong crying and tears to him who was able to save him from death, and having been heard for his godly fear,\n"
}, {
	"date": "4/28",
	"poem": "In a way, you may need to die today.\n\n\tBecause when people know their time is at an end\n\n\tThey start to forsake all and give their treasures away,\n\n\tAnd say goodbye to enemy, family and friend.\n\n\tNot only this, they confess long hidden sin,\n\n\tAnd forgive everyone and ask all to be forgiven.\n\n\tSo why not try to do this today while you are still living.",
	"verse": "Rom. 6:7",
	"versetext": "For he who has died has been freed from sin.\n"
}, {
	"date": "4/29",
	"poem": "We will not give up or give in\n\n\tUntil You establish Jerusalem\n\n\tEven then, we will keep going.\n\n\tAnd keep on worshiping.",
	"verse": "Isa. 62:7",
	"versetext": "and give him no rest, until he establishes,\nand until he makes Jerusalem a praise in the earth.\n"
}, {
	"date": "4/30",
	"poem": "All men are born dead in sin\n\n\tBecause that old man of Adam is living within.\n\n\tEven the new born babe and little children\n\n\tWill never truly live until they are born again",
	"verse": "Eph. 2:1",
	"versetext": "You were made alive when you were dead in transgressions and sins,\n"
}, {
	"date": "5/1",
	"poem": "All of us can look up to the same constant constellations\n\n\tMade up of ever steady stars and their connections\n\n\tThat give direction to those who follow their faithful courses.\n\n\tAs all can look down into the same Chapters and Verses\n\n\tAnd read the unchanging lines with others, over all generations,\n\n\tGetting the same guidance to our eternal heavenly destination.",
	"verse": "Jer. 31:35",
	"versetext": "Yahweh, who gives the sun for a light by day,\nand the ordinances of the moon and of the stars for a light by night,\nwho stirs up the sea, so that its waves roar;\nYahweh of Armies is his name, says:\n"
}, {
	"date": "5/2",
	"poem": "Let me worship without fear\n\n\tEven as in awe I fall down.\n\n\tMay Your glorious splendor draw near\n\n\tAnd Your Holy flood and fire surround.",
	"verse": "Psa. 96:9",
	"versetext": "Worship Yahweh in holy array.\nTremble before him, all the earth.\n"
}, {
	"date": "5/3",
	"poem": "If you were given a death sentence this morning,\n\n\tOr be told you were terminal this evening,\n\n\tWould it be so important to know the latest sport score?\n\n\tWould wickets, runs, tries, and goals matter anymore?\n\n\tWould the latest DVD, movie, or TV series be so vital?\n\n\tEven the news and current events would no longer be crucial.\n\n\tWell, you have already been given an eternal life sentence,\n\n\tSo why not start thinking more on your heavenly inheritance?",
	"verse": "Col. 3:2",
	"versetext": "Set your mind on the things that are above, not on the things that are on the earth.\n"
}, {
	"date": "5/4",
	"poem": "We will not give up or give in\n\n\tUntil He establish Jerusalem,\n\n\tAnd not even then,\n\n\tBecause we will be there with Him.",
	"verse": "Isa. 62:7",
	"versetext": "and give him no rest, until he establishes,\nand until he makes Jerusalem a praise in the earth.\n"
}, {
	"date": "5/5",
	"poem": "We are a flock of lions\n\n\tLed by a Lamb.\n\n\tA pride of sheep\n\n\tStanding bold on Zion",
	"verse": "Rev. 5:5",
	"versetext": "One of the elders said to me, “Don’t weep. Behold, the Lion who is of the tribe of Judah, the Root of David, has overcome; he who opens the book and its seven seals.”\n"
}, {
	"date": "5/6",
	"poem": "Seven eyes and seven horns,\n\n\tPerfect in power and wisdom.\n\n\tWise to be silent when shorn,\n\n\tPower to rule from Zion.",
	"verse": "Rev. 5:6",
	"versetext": "I saw in the middle of the throne and of the four living creatures, and in the middle of the elders, a Lamb standing, as though it had been slain, having seven horns, and seven eyes, which are the seven Spirits of God, sent out into all the earth.\n"
}, {
	"date": "5/7",
	"poem": "I am as a kid getting his first haircut\n\n\tScreaming for the shearing to stop\n\n\tMaking things more painful and sharp.\n\n\tNot a meek lamb, but like a ram, I kick and butt.",
	"verse": "Isa. 53:7",
	"versetext": "He was oppressed,\nyet when he was afflicted he didn’t open his mouth.\nAs a lamb that is led to the slaughter,\nand as a sheep that before its shearers is silent,\nso he didn’t open his mouth.\n"
}, {
	"date": "5/8",
	"poem": "Lord don’t stop for my sobbing or cease for my crying\n\n\tMake me smart enough to stay dumb under Your shears.\n\n\tI know when You hold the scissors, I am not dying.\n\n\tSo as You finish, like falling fleece, sweep away my fears.",
	"verse": "Acts 8:32",
	"versetext": "Now the passage of the Scripture which he was reading was this,\n“He was led as a sheep to the slaughter.\nAs a lamb before his shearer is silent,\nso he doesn’t open his mouth.\n"
}, {
	"date": "5/9",
	"poem": "Once I was given a haircut by a hypocrite.\n\n\tBecause the unkempt barber who held the shears\n\n\tHimself had shaggy hair hanging over his ears.\n\n\tI cried to my father how unfair and unjust all this was.\n\n\tHe told the clipper to keep cutting until I was quiet.\n\n\tAs dad drove me home bald and bleeding, he taught this lesson,\n\n\tSon, don’t judge others, look in the mirror until the cutting is done.",
	"verse": "Isa. 50:6",
	"versetext": "I gave my back to those who beat me,\nand my cheeks to those who plucked off the hair.\nI didn’t hide my face from shame and spitting.\n"
}, {
	"date": "5/10",
	"poem": "Peter wasn’t aiming for an ear when he attacked,\n\n\tWildly swinging his sword toward the head of Malchus.\n\n\tBut the Lord meant it when He bent, picked it up and put it back.\n\n\tWhen we try to defend Jesus, He ends up saving others from us.",
	"verse": "John 18:10",
	"versetext": "Simon Peter therefore, having a sword, drew it, and struck the high priest’s servant, and cut off his right ear. The servant’s name was Malchus.\n"
}, {
	"date": "5/11",
	"poem": "We have eternal life\n\n\tIt’s already given,\n\n\tSo cease from strife\n\n\tAnd start living.",
	"verse": "1John 5:11",
	"versetext": "The testimony is this, that God gave to us eternal life, and this life is in his Son.\n"
}, {
	"date": "5/12",
	"poem": "Let living waters keeping flowing and flowing\n\n\tFrom summer to winter and ocean to ocean.\n\n\tEven when we feel we can’t get going\n\n\tThe spring of revival is always in motion.",
	"verse": "Zec. 14:8",
	"versetext": "It will happen in that day, that living waters will go out from Jerusalem; half of them toward the eastern sea, and half of them toward the western sea; in summer and in winter will it be.\n"
}, {
	"date": "5/13",
	"poem": "Mary was the name of many of the women\n\n\tWho walked with, served and loved Jesus.\n\n\tThough now it sounds so sweet and is such a popular name.\n\n\tIts actual meaning and translation is ‘bitterness.’\n\n\tThroughout history females have borne not just the children\n\n\tBut such an unequal amount of sorrow and pain.\n\n\tYet as we find with the waters of Marah, and embittered Naomi,\n\n\tThe sour becomes sweet though Calvary’s Tree.",
	"verse": "Ex. 15:25",
	"versetext": "Then he cried to Yahweh. Yahweh showed him a tree, and he threw it into the waters, and the waters were made sweet. There he made a statute and an ordinance for them, and there he tested them;\n"
}, {
	"date": "5/14",
	"poem": "During His final night and meal\n\n\tThe Lord wrapped Himself in a towel\n\n\tA foot rag, soon soaked and soiled\n\n\tFrom followers’ feet, that would shortly flee.\n\n\tBut in eternity we see Him girdled in gold.\n\n\tIt will be the same for you and me.\n\n\tThose we bear and care for down here\n\n\tWill be ornaments for us forever up there.",
	"verse": "Rev. 1:13",
	"versetext": "And among the lamp stands was one like a son of man, clothed with a robe reaching down to his feet, and with a golden sash around his chest.\n"
}, {
	"date": "5/15",
	"poem": "A last act of Jesus at that last supper on that last night\n\n\tWas to wash His disciple’s scruffy feet.\n\n\tThere may be a way for you to shine your light\n\n\tOther than from behind a mike and pulpit.\n\n\tHow about kneeling behind a shoeshine kit?",
	"verse": "John 13:5",
	"versetext": "Then he poured water into the basin, and began to wash the disciples’ feet, and to wipe them with the towel that was wrapped around him.\n"
}, {
	"date": "5/16",
	"poem": "Don’t yield to your youthful lusts.\n\n\tIf you are young, you better run\n\n\tLike Joseph did so long ago.\n\n\tDon’t debate. Just get out and go.",
	"verse": "1Cor. 6:18",
	"versetext": "Flee sexual immorality! “Every sin that a man does is outside the body,” but he who commits sexual immorality sins against his own body.\n"
}, {
	"date": "5/17",
	"poem": "Take the old me away\n\n\tMake me all new in every way\n\n\tAnd cause, ever and always,\n\n\tOnly Your new man to stay.",
	"verse": "2Cor. 5:17",
	"versetext": "Therefore if anyone is in Christ, he is a new creation. The old things have passed away. Behold, all things have become new.\n"
}, {
	"date": "5/18",
	"poem": "Are you stuck to a World Wide Web,\n\n\tEnsnared in the Internet,\n\n\tEver searching wherever led,\n\n\tInstead of at rest in your bed?",
	"verse": "Job 18:8",
	"versetext": "For he is cast into a net by his own feet,\nand he wanders into its mesh.\n"
}, {
	"date": "5/19",
	"poem": "Are you bound in your house,\n\n\tAttached to a mouse\n\n\tBut losing your home,\n\n\tConnected to billions, but sitting alone?\n\n\tOr are you out surfing and scrolling on a tablet?\n\n\tIt is way past time for you to fast and diet,\n\n\tNot from food but your phone.",
	"verse": "Isa. 58:6",
	"versetext": "“Isn’t this the fast that I have chosen:\nto release the bonds of wickedness,\nto undo the straps of the yoke,\nto let the oppressed go free,\nand that you break every yoke?\n"
}, {
	"date": "5/20",
	"poem": "At Babel new tongues divided everyone\n\n\tBut when Pentecost was fully come,\n\n\tAnd the disciples spoke in new tongues,\n\n\tIt brought all the nations in Jerusalem\n\n\tTogether to hear glorious things God had done.",
	"verse": "Act. 2:6",
	"versetext": "When this sound was heard, the multitude came together, and were bewildered, because everyone heard them speaking in his own language.\n"
}, {
	"date": "5/21",
	"poem": "One day your accusers may all be dead and gone\n\n\tWith no one left to recall all the crimes you have done,\n\n\tNo one alive to remember and condemn your wrongs.\n\n\tBy default, in may appear that you have won.\n\n\tBut with no enemies, you have no one to forgive,\n\n\tAnd above is a Witness and Judge that ever lives.",
	"verse": "Job 34:21",
	"versetext": "“For his eyes are on the ways of a man.\nHe sees all his goings.\n"
}, {
	"date": "5/22",
	"poem": "Be on your knees\n\n\tUnceasingly.",
	"verse": "1The. 5:17",
	"versetext": "Pray without ceasing.\n"
}, {
	"date": "5/23",
	"poem": "Men chasing wind as the sun circles humanity,\n\n\tRaising up towers, as they return to dust,\n\n\tThinking their treasures will never rust.\n\n\tIt is not in God that such idolaters trust\n\n\tBut the futile objects of their own lust.\n\n\tWinning such riches impoverishes us,\n\n\tAnd always ends in vanity.",
	"verse": "Ecc. 12:8",
	"versetext": "“Vanity of vanities,” says the Preacher.\n“All is vanity!”\n"
}, {
	"date": "5/24",
	"poem": "When you are filled more and more with God’s Word\n\n\tYou begin to lose sight of the things of this world.\n\n\tAs we seek eternal things, the more we will see the unseen\n\n\tAnd then the temporary loses value and meaning.",
	"verse": "2Cor. 4:18",
	"versetext": "while we don’t look at the things which are seen, but at the things which are not seen. For the things which are seen are temporal, but the things which are not seen are eternal.\n"
}, {
	"date": "5/25",
	"poem": "Jesus ever lives to make intercession\n\n\tFor us to become God’s perfected possession.",
	"verse": "Heb. 7:25",
	"versetext": "Therefore he is also able to save to the uttermost those who draw near to God through him, seeing that he lives forever to make intercession for them.\n"
}, {
	"date": "5/26",
	"poem": "Satan tests to make us fail,\n\n\tThe ones God gives teach us to prevail.",
	"verse": "Psa. 26:2",
	"versetext": "Examine me, Yahweh, and prove me.\nTry my heart and my mind.\n"
}, {
	"date": "5/27",
	"poem": "The Devil sends trials to make us fall.\n\n\tGod’s make us stand strong and tall.",
	"verse": "Job 1:9",
	"versetext": "Then Satan answered Yahweh, and said, “Does Job fear God for nothing?\n"
}, {
	"date": "5/28",
	"poem": "We remember those who have gone before us\n\n\tAnd are now above as a cloud of witnesses.\n\n\tMany lives sacrificed had no medals awarded,\n\n\tBut when Jesus returns they will be rewarded.",
	"verse": "Col. 3:24",
	"versetext": "knowing that from the Lord you will receive the reward of the inheritance; for you serve the Lord Christ.\n"
}, {
	"date": "5/29",
	"poem": "A tomb can be a dark closed door to doom\n\n\tBut to the saved it is more like a womb.\n\n\tAsleep within the earth, in an instant they bloom\n\n\tWhen they hear the secret shout from the clouds on high,\n\n\tSuddenly the redeemed rise in their new bodies and fly.",
	"verse": "1Th. 4:16",
	"versetext": "For the Lord himself will descend from heaven with a shout, with the voice of the archangel, and with God’s trumpet. The dead in Christ will rise first,\n"
}, {
	"date": "5/30",
	"poem": "In these last days men will create new sins and depravation.\n\n\tNew chemical and electronic bondages and addictions,\n\n\tNew genders invented along with their new perversions.\n\n\tThese abominations should convict us and all creation to see\n\n\tThe Judge of all flesh is just to send sudden fiery destruction.",
	"verse": "2Pet. 3:7",
	"versetext": "But the heavens that now exist, and the earth, by the same word have been stored up for fire, being reserved against the day of judgment and destruction of ungodly men.\n"
}, {
	"date": "5/31",
	"poem": "I thought the more I loved Jesus\n\n\tI would have to love men less.\n\n\tBut it wasn’t like this,\n\n\tMy love just became less selfish.",
	"verse": "Mat. 22:39",
	"versetext": "\nA second likewise is this, ‘You shall love your neighbor as yourself.’\n"
}, {
	"date": "6/1",
	"poem": "Stay in today.\n\n\tTomorrow is never here.\n\n\tYesterday has gone away.\n\n\tEternity is very near.",
	"verse": "Mat. 6:34",
	"versetext": "\nTherefore don’t be anxious for tomorrow, for tomorrow will be anxious for itself. Each day’s own evil is sufficient.\n"
}, {
	"date": "6/2",
	"poem": "Lord I want You and Your word to live in me.\n\n\tI purpose to put on Your new man and mind.\n\n\tLet Your character replace mine.\n\n\tThen Your perfect image will shine,\n\n\tAnd Your nature will be all that others see.",
	"verse": "Col. 3:10",
	"versetext": "and have put on the new man, who is being renewed in knowledge after the image of his Creator,\n"
}, {
	"date": "6/3",
	"poem": "You may be weary working for your family\n\n\tOr have become tired laboring in the ministry\n\n\tBut never get tired of ministering,\n\n\tLoving, serving, sharing, giving\n\n\tBecause the blessed do it for all eternity.",
	"verse": "Rev. 22:3",
	"versetext": "There will be no curse any more. The throne of God and of the Lamb will be in it, and his servants will serve him.\n"
}, {
	"date": "6/4",
	"poem": "Anyone, especially Satan, can make good into worse,\n\n\tBut Jesus is the One that creates blessings from a curse.",
	"verse": "Gen. 3:1",
	"versetext": "Now the serpent was more subtle than any animal of the field which Yahweh God had made. He said to the woman, “Has God really said, ‘You shall not eat of any tree of the garden?’”\n"
}, {
	"date": "6/5",
	"poem": "Once I felt the earth’s crust was like an eggshell\n\n\tThrough which multitudes had fallen into Hell.\n\n\tBeing saved I was safe, but not the burning souls who fell.\n\n\tWhich reminded me of how close eternity is,\n\n\tAnd suddenly I felt an urgency to witness.",
	"verse": "Psa. 106:17",
	"versetext": "The earth opened and swallowed up Dathan,\nand covered the company of Abiram.\n"
}, {
	"date": "6/6",
	"poem": "Once when I felt so low and of no worth,\n\n\tPhysically and spiritually sick at the same time,\n\n\tI got a momentary vision of New Earth.\n\n\tThough it is the least and lowest place of heaven,\n\n\tJust that short glimpse made me smile and sing again\n\n\tAnd motivated me to get up, get out and get to witnessing.",
	"verse": "2Pet. 3:13",
	"versetext": "But, according to his promise, we look for new heavens and a new earth, in which righteousness dwells.\n"
}, {
	"date": "6/7",
	"poem": "When we bow our knees, we end up standing tall\n\n\tBut those that stand against God, in the end will fall.\n\n\tIn this life those who refuse and reject Him,\n\n\tWith the rejected will be condemned.\n\n\tOne day those who wouldn’t bow, will bend\n\n\tAnd all their tongues confess, Jesus wins.",
	"verse": "Php. 2:10",
	"versetext": "that at the name of Jesus every knee should bow, of those in heaven, those on earth, and those under the earth,\n"
}, {
	"date": "6/8",
	"poem": "If someone talks to themselves don’t always think them odd.\n\n\tIt doesn’t always mean they have a split personality.\n\n\tMan too is a trinity.\n\n\tYour spirit may speak encouragement\n\n\tAnd your soul hear it.\n\n\tYou can tell the soul to get up and worship.\n\n\tYou soul can thank your body for its assistance\n\n\tIn keeping you breathing, moving and serving God.",
	"verse": "Psa. 43:5",
	"versetext": "Why are you in despair, my soul?\nWhy are you disturbed within me?\nHope in God!\nFor I shall still praise him:\nmy Savior, my helper, and my God.\n"
}, {
	"date": "6/9",
	"poem": "When you begin to test your Maker\n\n\tIt always ends in your failure.\n\n\tLet the Spirit give you a daily examination\n\n\tUntil the final one at resurrection.",
	"verse": "Deut. 6:16",
	"versetext": "You shall not tempt Yahweh your God, as you tempted him in Massah.\n"
}, {
	"date": "6/10",
	"poem": "Reign over me.\n\n\tI yield willingly,\n\n\tEven if it’s against my will.\n\n\tLet Your Kingdom come,\n\n\tAnd Thy will be done\n\n\tHelp me surrender to be free.",
	"verse": "Mat. 6:10",
	"versetext": "\nLet your Kingdom come. Let your will be done, as in heaven, so on earth.\n\n"
}, {
	"date": "6/11",
	"poem": "The one and only Holy Bible, ever new,\n\n\tThat old story that never comes to an end,\n\n\tThe only Book that we will never finish.\n\n\tBut if we let it accomplish its purpose\n\n\tIt will complete a perfect work in us\n\n\tMaking us the Lamb’s wife, New Jerusalem.",
	"verse": "Isa. 55:11",
	"versetext": "so is my word that goes out of my mouth:\nit will not return to me void,\nbut it will accomplish that which I please,\nand it will prosper in the thing I sent it to do.\n"
}, {
	"date": "6/12",
	"poem": "When You visit us\n\n\tIt becomes a holiday,\n\n\tBirthday and Christmas.",
	"verse": "Psa. 106:4",
	"versetext": "Remember me, Yahweh, with the favor that you show to your people.\nVisit me with your salvation,\n"
}, {
	"date": "6/13",
	"poem": "Some treat the grace of God like grease\n\n\tAnd think they can slip and slide on it into heaven.\n\n\tOthers live in folly, luxury and extravagance\n\n\tAs if their Christian liberty was a sinner’s license.\n\n\tMany run first to doctors and medicine\n\n\tAnd never exercise faith, prayer or repentance,\n\n\tAs if they will get to paradise in an ambulance.\n\n\tGrace works in us to make us work, not live in ease.",
	"verse": "1Pet. 2:16",
	"versetext": "as free, and not using your freedom for a cloak of wickedness, but as bondservants of God.\n"
}, {
	"date": "6/14",
	"poem": "The things good to you are often not good for you.\n\n\tThe things that attract you often subtract from you.\n\n\tThe people, places and things that charm often harm.\n\n\tThe things that seem nice and entice often end in vice.\n\n\tThe things that induce and seduce us often reduce us.\n\n\tThe things we desire can cause us to retire in the fire.",
	"verse": "Jas. 1:14",
	"versetext": "But each one is tempted when he is drawn away by his own lust, and enticed.\n"
}, {
	"date": "6/15",
	"poem": "Seek for more of God, not people.\n\n\tWait for Him and His approval.\n\n\tThe messages you get and give today\n\n\tTo a small and insignificant assembly\n\n\tWill speak to multitudes later\n\n\tAnd bear fruit forever.",
	"verse": "Zec. 4:10",
	"versetext": "Indeed, who despises the day of small things? For these seven shall rejoice, and shall see the plumb line in the hand of Zerubbabel. These are Yahweh’s eyes, which run back and forth through the whole earth.”\n"
}, {
	"date": "6/16",
	"poem": "Stars aren’t just the physical ones in the heavens\n\n\tBut are seen symbolically as Abraham’s sons,\n\n\tAnd messengers in the hand of the Son of Man,\n\n\tAlso in the crown of a wonderful woman travailing.\n\n\tYet the best and brightest One comes in the morning.",
	"verse": "Rev. 22:16",
	"versetext": "\nI, Jesus, have sent my angel to testify these things to you for the assemblies. I am the root and the offspring of David; the Bright and Morning Star.”\n"
}, {
	"date": "6/17",
	"poem": "When we age into adulthood and mature,\n\n\tWe forget what it was like to be a helpless baby.\n\n\tWe become so experienced, self-reliant and sure.\n\n\tStill the Spirit of God’s Son in us wants to cry out, ‘Daddy.’",
	"verse": "Gal. 4:6",
	"versetext": "And because you are children, God sent out the Spirit of his Son into your hearts, crying, “Abba, Father!”\n"
}, {
	"date": "6/18",
	"poem": "One day I overheard someone gossiping about me,\n\n\tDescribing me very critically and negatively.\n\n\tIt cut me through and through,\n\n\tNot least because all that was said was true.\n\n\tAnd though that truth spoken was very revealing,\n\n\tSaid without love, it hurt without healing.",
	"verse": "Eph. 4:15",
	"versetext": "but speaking truth in love, we may grow up in all things into him, who is the head, Christ;\n"
}, {
	"date": "6/19",
	"poem": "Some loves are blind, deaf and dumb.\n\n\tThose kinds can’t hear or see any fault or flaw,\n\n\tOr recognize any wrong in its object of affection.\n\n\tBut God’s perfect love clearly sees and knows all,\n\n\tYet it believes and foresees beauty and perfection\n\n\tWhere there is none.",
	"verse": "Rom. 12:9",
	"versetext": "Let love be without hypocrisy. Abhor that which is evil. Cling to that which is good.\n"
}, {
	"date": "6/20",
	"poem": "There once was a girl who so loved her father\n\n\tAnd always held him in reverence, honor and awe.\n\n\tTo others he was just a source of trouble and bother.\n\n\tYet after some time, the devotion of the daughter\n\n\tCaused others to value and see him through the daughter’s eyes.",
	"verse": "Isa. 42:19",
	"versetext": "Who is blind, but my servant?\nOr who is as deaf as my messenger whom I send?\nWho is as blind as he who is at peace,\nand as blind as Yahweh’s servant?\n"
}, {
	"date": "6/21",
	"poem": "Bibles battered and worn\n\n\tWith loosened pages, wrinkled and torn,\n\n\tWill be held in cleansed hands and hearts\n\n\tBy the sanctified, getting ready to depart.",
	"verse": "Act. 20:32",
	"versetext": "Now, brothers, I entrust you to God, and to the word of his grace, which is able to build up, and to give you the inheritance among all those who are sanctified.\n"
}, {
	"date": "6/22",
	"poem": "Some people have the quality of manure.\n\n\tThough you continually wash and polish them\n\n\tThey never become clean or pure\n\n\tAnd you end up filthy and smelling foul.",
	"verse": "1Ki. 14:10",
	"versetext": "therefore, behold, I will bring evil on the house of Jeroboam, and will cut off from Jeroboam everyone who urinates on a wall, he who is shut up and he who is left at large in Israel, and will utterly sweep away the house of Jeroboam, as a man sweeps away dung, until it is all gone.\n"
}, {
	"date": "6/23",
	"poem": "People are problems.\n\n\tEverywhere has got them.\n\n\tStill you must love them.\n\n\tOnly God can solve them.",
	"verse": "1Pet. 4:8",
	"versetext": "And above all things be earnest in your love among yourselves, for love covers a multitude of sins.\n"
}, {
	"date": "6/24",
	"poem": "Sodomites falsely label themselves Proud, Gay and GLAAD.\n\n\tAnd to their acronym of perversions new initials continually add,\n\n\tWhile they march under the symbol of an inclusive rainbow flag.\n\n\tIronic that this is the sign from the flood of Judgement done,\n\n\tAnd Sodom is the one of the fiery Judgment to come.",
	"verse": "Jude 1:7",
	"versetext": "Jude, a servant of Jesus Christ, and brother of James, to those who are called, sanctified by God the Father, and kept for Jesus Christ:\n"
}, {
	"date": "6/25",
	"poem": "Trust in man ends in vain\n\n\tTrust in God ends unashamed.",
	"verse": "Psa. 25:3",
	"versetext": "Yes, no one who waits for you shall be shamed.\nThey shall be shamed who deal treacherously without cause.\n"
}, {
	"date": "6/26",
	"poem": "I don’t like laying down with my back to the ground.\n\n\tMaybe because the cold earth makes me aware\n\n\tPart of me may shortly be there, six feet down.\n\n\tNevertheless, I’d be looking up towards clouds and air,\n\n\tSoon to be meeting the rest of me up there.",
	"verse": "Php. 1:23",
	"versetext": "But I am in a dilemma between the two, having the desire to depart and be with Christ, which is far better.\n"
}, {
	"date": "6/27",
	"poem": "Only below will you sing through sorrow and sadness.\n\n\tYou can do it even when there is no light.\n\n\tJob said this is when songs are given.\n\n\tPaul and Silas did it at midnight in prison.\n\n\tJesus sang a last hymn with them that last night.\n\n\tBut above it will be done in unending light and gladness.",
	"verse": "Mat. 26:30",
	"versetext": "When they had sung a hymn, they went out to the Mount of Olives.\n"
}, {
	"date": "6/28",
	"poem": "If you wake up in the middle of night\n\n\tWithout the help of alarms or light,\n\n\tThen lift up your arms and eyes toward God’s face.\n\n\tAnywhere and everywhere can become a Holy Place.",
	"verse": "Psa. 134:1",
	"versetext": "Look! Praise Yahweh, all you servants of Yahweh,\nwho stand by night in Yahweh’s house!\n"
}, {
	"date": "6/29",
	"poem": "God’s gifts are given to be given,\n\n\tNot used for reward or recompense.\n\n\tThe more of them you give, you get.\n\n\tSo start distributing!",
	"verse": "1Cor. 14:12",
	"versetext": "So also you, since you are zealous for spiritual gifts, seek that you may abound to the building up of the assembly.\n"
}, {
	"date": "6/30",
	"poem": "Our individual calendar may end before others’ are done,\n\n\tBut we are going to a City that has no need of one.\n\n\tOnly one perfect Day going ever on,\n\n\tWith no more dark or nights to come.",
	"verse": "Rev. 22:5",
	"versetext": "There will be no night, and they need no lamp light; for the Lord God will illuminate them. They will reign forever and ever.\n"
}, {
	"date": "7/1",
	"poem": "One thing actually evolving is the false theory of evolution.\n\n\tIt was not Scientific Revolution, but a pollution.\n\n\tThere has never been a beneficial mutation.\n\n\tBy its very connotation it is a mutilation.",
	"verse": "Rom. 1:23",
	"versetext": "and traded the glory of the incorruptible God for the likeness of an image of corruptible man, and of birds, and four-footed animals, and creeping things.\n"
}, {
	"date": "7/2",
	"poem": "Darwin’s disciples worship their founder and deny their creator.\n\n\tThe link is missing because fallen man is its maker.\n\n\tFrom the Biblical record and human nature we can see\n\n\tMankind has not been evolving, but devolving,\n\n\tSince they disobeyed and ate from the tree.",
	"verse": "Rom. 1:25",
	"versetext": "who exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is blessed forever. Amen.\n"
}, {
	"date": "7/3",
	"poem": "In the middle we are furthest from both ends.\n\n\tIn this stagnant generation and nation,\n\n\tAmid our lethargy and hesitation,\n\n\tGod, do something new and revive us again.",
	"verse": "Hab. 3:2",
	"versetext": "Yahweh, I have heard of your fame.\nI stand in awe of your deeds, Yahweh.\nRenew your work in the middle of the years.\nIn the middle of the years make it known.\nIn wrath, you remember mercy.\n"
}, {
	"date": "7/4",
	"poem": "The only true and lasting freedom\n\n\tComes to man through God’s Son.",
	"verse": "John 8:36",
	"versetext": "\nIf therefore the Son makes you free, you will be free indeed.\n\n"
}, {
	"date": "7/5",
	"poem": "This Jesus,\n\n\tWe witness,\n\n\tNot just for others\n\n\tBut also ours.",
	"verse": "Act 2:32",
	"versetext": "This Jesus God raised up, to which we all are witnesses.\n"
}, {
	"date": "7/6",
	"poem": "We can only come boldly to God’s throne\n\n\tBy the precious blood of Jesus Christ alone.",
	"verse": "Heb. 10:19",
	"versetext": "Having therefore, brothers, boldness to enter into the holy place by the blood of Jesus,\n"
}, {
	"date": "7/7",
	"poem": "Pour out Your Spirit without measure,\n\n\tAn inexhaustible treasure,\n\n\tThat ever flowing river,\n\n\tFor us to drink from fully, forever\n\n\tWith overflowing and unending pleasure.",
	"verse": "John 7:37",
	"versetext": "Now on the last and greatest day of the feast, Jesus stood and cried out,\n“If anyone is thirsty, let him come to me and drink!\n\n"
}, {
	"date": "7/8",
	"poem": "Christ stopped His quotation before the end\n\n\tAs now is still in the Acceptable Year,\n\n\tUntil He returns to appear in the air,\n\n\tThen the time of judgement and vengeance will begin.",
	"verse": "Isa. 61:2",
	"versetext": "to proclaim the year of Yahweh’s favor,\nand the day of vengeance of our God;\nto comfort all who mourn;\n"
}, {
	"date": "7/9",
	"poem": "Now is the Acceptable Time to hear His voice.\n\n\tToday is the Day of Salvation.\n\n\tWhen you listen to Him with revelation\n\n\tThat is the time to make your heart’s choice.",
	"verse": "2Cor. 6:2",
	"versetext": "for he says,\n“At an acceptable time I listened to you,\nin a day of salvation I helped you.”\nBehold, now is the acceptable time. Behold, now is the day of salvation.\n"
}, {
	"date": "7/10",
	"poem": "Only one judge is totally just and right\n\n\tAnd will bring every hidden thing to light.\n\n\tTherefore, to His decisions surrender\n\n\tAnd He will prove your strong defender.",
	"verse": "Psa. 7:10",
	"versetext": "My shield is with God,\nwho saves the upright in heart.\n"
}, {
	"date": "7/11",
	"poem": "Oh, all conquering Lion\n\n\tWho was the yielding Lamb,\n\n\tThat was slain before being born,\n\n\tHaving seven eyes and seven horns.\n\n\tYou see and know all, perfect in wisdom,\n\n\tPerfect in power, establish Your Kingdom.",
	"verse": "Rev. 5:6",
	"versetext": "I saw in the middle of the throne and of the four living creatures, and in the middle of the elders, a Lamb standing, as though it had been slain, having seven horns, and seven eyes, which are the seven Spirits of God, sent out into all the earth.\n"
}, {
	"date": "7/12",
	"poem": "Some are terrified of the heights of heaven\n\n\tAnd the Lofty One who dwells therein.\n\n\tThey cling to comforts and habits of habitations below\n\n\tThat never threaten or challenge what they think they know.",
	"verse": "Isa. 57:15",
	"versetext": "For thus says the high and lofty One who inhabits eternity,\nwhose name is Holy:\n“I dwell in the high and holy place, with him also who is of a contrite and humble spirit,\nto revive the spirit of the humble,\nand to revive the heart of the contrite.\n"
}, {
	"date": "7/13",
	"poem": "Some souls are afraid of Paradise.\n\n\tIt’s not that they don’t want to go\n\n\tThey just find this present world too nice\n\n\tAnd are comfortable with the status quo.",
	"verse": "1John 2:15",
	"versetext": "Don’t love the world or the things that are in the world. If anyone loves the world, the Father’s love isn’t in him.\n"
}, {
	"date": "7/14",
	"poem": "No hunger or thirst.\n\n\tNo trials or curse.\n\n\tNo tears, fears,\n\n\tNo boredom or malaise,\n\n\tNeither death nor disease.\n\n\tWe will serve God eternally,\n\n\tJoyfully, fruitfully, faithfully.",
	"verse": "Rev. 22:3",
	"versetext": "There will be no curse any more. The throne of God and of the Lamb will be in it, and his servants will serve him.\n"
}, {
	"date": "7/15",
	"poem": "Oh God guide our guides,\n\n\tAnd guard the guards.\n\n\tBuild the builders\n\n\tAnd lead the leaders.",
	"verse": "Jer. 3:15",
	"versetext": "I will give you shepherds according to my heart, who will feed you with knowledge and understanding.\n"
}, {
	"date": "7/16",
	"poem": "Please pastor our pastors,\n\n\tMinister to our ministers\n\n\tAnd teach the teachers.",
	"verse": "1Pet. 5:4",
	"versetext": "When the chief Shepherd is revealed, you will receive the crown of glory that doesn’t fade away.\n"
}, {
	"date": "7/17",
	"poem": "You are not a sinner because you sin.\n\n\tYou were born one.\n\n\tBefore anything was done\n\n\tSin was dwelling within.",
	"verse": "Rom. 7:17",
	"versetext": "So now it is no more I that do it, but sin which dwells in me.\n"
}, {
	"date": "7/18",
	"poem": "Don’t ask for a transfer or relocation\n\n\tInstead seek a transformation.\n\n\tIt’s not a move or change of venue\n\n\tThat’s needed, but a change in you.\n\n\tBloom where you are sown\n\n\tAnd every place becomes home.",
	"verse": "Ecc. 10:4",
	"versetext": "If the spirit of the ruler rises up against you, don’t leave your place; for gentleness lays great offenses to rest.\n"
}, {
	"date": "7/19",
	"poem": "One cannot restrain or speed the sun\n\n\tJust as you can’t bring or stop the rain.\n\n\tThere are some journeys that are easy and fun\n\n\tAnd others where you must pass through loss and pain.",
	"verse": "Act. 27:10",
	"versetext": "and said to them, “Sirs, I perceive that the voyage will be with injury and much loss, not only of the cargo and the ship, but also of our lives.”\n"
}, {
	"date": "7/20",
	"poem": "Revive us again,\n\n\tNever let it end!",
	"verse": "Psa. 85:6",
	"versetext": "Won’t you revive us again,\nthat your people may rejoice in you?\n"
}, {
	"date": "7/21",
	"poem": "Collecting, keeping; hoarding and heaping possessions\n\n\tCan become an endless obsession.\n\n\tCeaseless chasing of bargains and good deals\n\n\tWill hinder you from riches that are real.",
	"verse": "Lk. 12:21",
	"versetext": "\nSo is he who lays up treasure for himself, and is not rich toward God.”\n"
}, {
	"date": "7/22",
	"poem": "God, You are terrible in a wonderful way.\n\n\tWe fall in awe and tremble before\n\n\tYou Who rules winds, waves and shore.\n\n\tAnd tremble at every word You say.",
	"verse": "Jer. 5:22",
	"versetext": "Don’t you fear me?’ says Yahweh ‘Won’t you tremble at my presence, who have placed the sand for the bound of the sea, by a perpetual decree, that it can’t pass it? Though its waves toss themselves, yet they can’t prevail. Though they roar, they still can’t pass over it.’\n"
}, {
	"date": "7/23",
	"poem": "Every good and perfect gift comes from above\n\n\tFlowing down from the Fathers all wise love.\n\n\tLike rain, wind and light; abundant and free,\n\n\tCausing us to grow and increase fruitfully.",
	"verse": "Jas. 1:17",
	"versetext": "Every good gift and every perfect gift is from above, coming down from the Father of lights, with whom can be no variation, nor turning shadow.\n"
}, {
	"date": "7/24",
	"poem": "Not just natural gifts come from above\n\n\tBut also the spiritual and supernatural, which are the best.\n\n\tJesus, the Word, the Gospel, and Spirit like a Dove\n\n\tAll came down to us, and finally gifts of men from Christ.",
	"verse": "Eph. 4:11",
	"versetext": "He gave some to be apostles; and some, prophets; and some, evangelists; and some, shepherds and teachers;\n"
}, {
	"date": "7/25",
	"poem": "There once was a young Christian from PNG\n\n\tWho wanted with all her heart to be a missionary.\n\n\tShe felt called to forsake all and leave the land of her birth\n\n\tAnd take the Good News to the ends of the earth,\n\n\tSo she went out to do ministry in Washington, DC.",
	"verse": "Act. 13:47",
	"versetext": "For so has the Lord commanded us, saying,\n‘I have set you as a light for the Gentiles,\nthat you should bring salvation to the uttermost parts of the earth.’”\n\n"
}, {
	"date": "7/26",
	"poem": "“Be ye angry”\n\n\tIs not an instruction\n\n\tOr a permission\n\n\tBut an admission\n\n\tAnd recognition\n\n\tOf our limitations.\n\n\tSo before sunset\n\n\tGet rid of it.",
	"verse": "Eph. 4:26",
	"versetext": "“Be angry, and don’t sin.” Don’t let the sun go down on your wrath,\n"
}, {
	"date": "7/27",
	"poem": "If you don’t turn you will be spurned and burn.\n\n\tIf you don’t cry you will die and fry.\n\n\tIf you don’t believe you will grieve and leave.",
	"verse": "Acts 2:37",
	"versetext": "Now when they heard this, they were cut to the heart, and said to Peter and the rest of the apostles, “Brothers, what shall we do?”\n"
}, {
	"date": "7/28",
	"poem": "If you don’t baptize you will be denied and deprived.\n\n\tIf you aren’t anointed, you will be disowned and disappointed.\n\n\tIf you aren’t raptured, you will be captured and interred.",
	"verse": "Acts 2:38",
	"versetext": "Peter said to them, “Repent, and be baptized, every one of you, in the name of Jesus Christ for the forgiveness of sins, and you will receive the gift of the Holy Spirit.\n"
}, {
	"date": "7/29",
	"poem": "My brother, I wish I had been better to you\n\n\tDuring your life, and now that you’ve gone,\n\n\tI must carry on with good memories alone\n\n\tAnd wait to be together once again at home.",
	"verse": "Psa. 116:15",
	"versetext": "Precious in Yahweh’s sight is the death of his saints.\n"
}, {
	"date": "7/30",
	"poem": "More and more, those I knew, walked and worked with before\n\n\tHave gone on ahead and are in this world with me no more.\n\n\tIf this earth is getting emptier of those you have loved and known,\n\n\tIt is because Heaven is filling with those who will welcome you home.",
	"verse": "1Th. 4:15",
	"versetext": "For this we tell you by the word of the Lord, that we who are alive, who are left until the coming of the Lord, will in no way precede those who have fallen asleep.\n"
}, {
	"date": "7/31",
	"poem": "At funerals all are looking down\n\n\tWith frowns and tears falling to the ground.\n\n\tOnly one is facing the sun and clouds above\n\n\tToward the One smiling down in love.",
	"verse": "1Cor. 15:55",
	"versetext": "“Death, where is your sting?\nHades, where is your victory?”\n"
}, {
	"date": "8/1",
	"poem": "Battered, bruised and torn;\n\n\tDirty, calloused and worn\n\n\tAre wounded feet seen climbing our way,\n\n\tBut beautiful because of the message they convey.",
	"verse": "Isa. 52:7",
	"versetext": "How beautiful on the mountains are the feet of him who brings good news,\nwho publishes peace,\nwho brings good news,\nwho proclaims salvation,\nwho says to Zion, “Your God reigns!”\n"
}, {
	"date": "8/2",
	"poem": "Vacations from God\n\n\tUsually don’t go well.\n\n\tThey often end under the sod\n\n\tTo become holidays in Hell.",
	"verse": "Jon. 1:10",
	"versetext": "Then the men were exceedingly afraid, and said to him, “What have you done?” For the men knew that he was fleeing from the presence of Yahweh, because he had told them.\n"
}, {
	"date": "8/3",
	"poem": "The power of Jesus’ endless life\n\n\tProvides us with unending energy\n\n\tAnd gives saints the ability\n\n\tTo live this and the next life right.",
	"verse": "Heb. 7:16",
	"versetext": "who has been made, not after the law of a fleshly commandment, but after the power of an endless life:\n"
}, {
	"date": "8/4",
	"poem": "All my days\n\n\tI will praise!",
	"verse": "Isa. 38:20",
	"versetext": "Yahweh will save me.\nTherefore we will sing my songs with stringed instruments all the days of our life in Yahweh’s house.\n"
}, {
	"date": "8/5",
	"poem": "In these modern times there are still soothsayers and shamans.\n\n\tThese diviners examine the self-centered with many questions.\n\n\tThey take confessions and give excuses and absolution.\n\n\tFor the slightest problem they have an answer or solution.\n\n\tThe prophets and priests of this modern day mental mythology\n\n\tAre the witchdoctors of the pseudoscience called psychology.",
	"verse": "1Tim. 6:20",
	"versetext": "Timothy, guard that which is committed to you, turning away from the empty chatter and oppositions of what is falsely called knowledge;\n"
}, {
	"date": "8/6",
	"poem": "Jesus’ own friends and family\n\n\tSupposed Him crazy.\n\n\tKings thought David and Paul odd.\n\n\tSo when you go mad for God\n\n\tYou are in good company",
	"verse": "2Cor. 5:13",
	"versetext": "For if we are beside ourselves, it is for God. Or if we are of sober mind, it is for you.\n"
}, {
	"date": "8/7",
	"poem": "In the past idols were of wood, stone, silver and gold.\n\n\tNow they are plastic, electronic and digital code.\n\n\tTaking bytes from Apples to make them wiser than their creator\n\n\tPeople try to make machines with AI in the image of men.\n\n\tInstead of knowing God, these idolaters claim to know more than Him.",
	"verse": "Rom. 1:23",
	"versetext": "and traded the glory of the incorruptible God for the likeness of an image of corruptible man, and of birds, and four-footed animals, and creeping things.\n"
}, {
	"date": "8/8",
	"poem": "In this present life the church is like a wife\n\n\tAdorned with heavenly treasures\n\n\tBut continually travailing and in pain\n\n\tTo bring forth the character of Christ in this life\n\n\tAnd bear overcomers that will forever reign.",
	"verse": "Rev. 12:2",
	"versetext": "She was with child. She cried out in pain, laboring to give birth.\n"
}, {
	"date": "8/9",
	"poem": "When we finally live forever with the Lord\n\n\tAll the trials we thought so lengthy and heavy\n\n\tWill not even be thought of or considered\n\n\tAs we dwell under the weight of God’s glory.",
	"verse": "2Cor. 4:17",
	"versetext": "For our light affliction, which is for the moment, works for us more and more exceedingly an eternal weight of glory;\n"
}, {
	"date": "8/10",
	"poem": "Grains of wheat, barley, rice or corn,\n\n\tEverywhere mankind lives on grass,\n\n\tAnd like its flowers, all quickly fade and pass\n\n\tUnless by the Word of God they are reborn.",
	"verse": "Isa. 40:6",
	"versetext": "The voice of one saying, “Cry!”\nOne said, “What shall I cry?”\n“All flesh is like grass,\nand all its glory is like the flower of the field.\n"
}, {
	"date": "8/11",
	"poem": "Like cattle descending into a lush fertile plain\n\n\tAfter a long climb filled with hardship and pain,\n\n\tWhen the Spirit leads, the end is rest and refreshing\n\n\tIn a fruitful place of peace and blessing.",
	"verse": "Isa. 63:14",
	"versetext": "As the livestock that go down into the valley,\nYahweh’s Spirit caused them to rest.\nSo you led your people, to make yourself a glorious name.\n"
}, {
	"date": "8/12",
	"poem": "He drank that poisoned cup of God’s fury,\n\n\tWas beaten and broken to heal you and me.\n\n\tHis blood He poured out on that cursed tree\n\n\tAnd abolished our sin and death at Calvary.",
	"verse": "Isa. 51:22",
	"versetext": "Thus says your Lord Yahweh,\nyour God who pleads the cause of his people,\n“Behold, I have taken out of your hand the cup of staggering,\neven the bowl of the cup of my wrath.\nYou will not drink it any more:\n"
}, {
	"date": "8/13",
	"poem": "I owe everyone an infinite debt\n\n\tThat increases with each soul I come to know.\n\n\tThe more I meet the more I owe.\n\n\tNot to mention the multitudes unmet.",
	"verse": "Rom. 13:8",
	"versetext": "Owe no one anything, except to love one another; for he who loves his neighbor has fulfilled the law.\n"
}, {
	"date": "8/14",
	"poem": "I was in a debtor’s prison\n\n\tFor all those I left unforgiven.\n\n\tTheir tears I didn’t dry, or even try,\n\n\tAnd left them alone to die.\n\n\tYet the Lord tells, though I own you, I love you so,\n\n\tAnd have given My all to you, so I command you to go.\n\n\tSpend yourself and be spent\n\n\tOn everyone to whom you are sent.",
	"verse": "2Cor. 12:15",
	"versetext": "I will most gladly spend and be spent for your souls. If I love you more abundantly, am I loved the less?\n"
}, {
	"date": "8/15",
	"poem": "To the uninstructed and unlearned\n\n\tWho can’t understand or speak Christian,\n\n\tAnd don’t know our terms and jargon,\n\n\tWords like propitiation need clarification.\n\n\tRedemption demands definition.\n\n\tJustification requires some explanation.\n\n\tEven Calvary may need a translation.",
	"verse": "1Cor. 14:23",
	"versetext": "If therefore the whole assembly is assembled together and all speak with other languages, and unlearned or unbelieving people come in, won’t they say that you are crazy?\n"
}, {
	"date": "8/16",
	"poem": "In Your Name\n\n\tI will not be ashamed.\n\n\tBy the promises You Made\n\n\tI will not be afraid.",
	"verse": "Psa. 27:1",
	"versetext": "Yahweh is my light and my salvation.\nWhom shall I fear?\nYahweh is the strength of my life.\nOf whom shall I be afraid?\n"
}, {
	"date": "8/17",
	"poem": "God’s children aren’t always assured of good meetings,\n\n\tBut they are guaranteed needed and good beatings.",
	"verse": "Hebrews 12:6",
	"versetext": "For whom the Lord loves, he chastens,\nand scourges every son whom he receives.”\n"
}, {
	"date": "8/18",
	"poem": "I was plowed and furrowed by a rod on the rear.\n\n\tSome lessons need to be painfully planted on the posterior\n\n\tAnd frequently watered with my salty tears.\n\n\tBut they will one day bear peaceable fruit on the exterior.",
	"verse": "Hebrews 12:11",
	"versetext": "All chastening seems for the present to be not joyous but grievous; yet afterward it yields the peaceful fruit of righteousness to those who have been exercised thereby.\n"
}, {
	"date": "8/19",
	"poem": "Weak knees with arms hanging down\n\n\tCause even more harm on uneven ground.\n\n\tSo rather than trying to modify the topography\n\n\tStand up, step up and correct your anatomy.",
	"verse": "Hebrews 12:12",
	"versetext": "Therefore lift up the hands that hang down and the feeble knees,\n\n"
}, {
	"date": "8/20",
	"poem": "Cause us to seek You more and more,\n\n\tBut You are always and already near,\n\n\tStanding, knocking at our door.\n\n\tCause us to open without fear.",
	"verse": "Rev. 3:20",
	"versetext": "\nBehold, I stand at the door and knock. If anyone hears my voice and opens the door, then I will come in to him, and will dine with him, and he with me.\n\n"
}, {
	"date": "8/21",
	"poem": "You don’t know all.\n\n\tSo don’t get too tall,\n\n\tYou do know some things.\n\n\tSo don’t try to be too small.\n\n\tYou are somewhere in between.",
	"verse": "Php. 3:12",
	"versetext": "Not that I have already obtained, or am already made perfect; but I press on, that I may take hold of that for which also I was taken hold of by Christ Jesus.\n"
}, {
	"date": "8/22",
	"poem": "I have found during times of my worst sorrow and grieving,\n\n\tWhen swept away by rivers of tears and weeping,\n\n\tFeeling crushed and drained, within my deepest part,\n\n\tAn unseen spring of God’s joy was still bubbling in my heart.",
	"verse": "Isa. 12:3",
	"versetext": "Therefore with joy you will draw water out of the wells of salvation.\n"
}, {
	"date": "8/23",
	"poem": "God, my goal\n\n\tIs You take control.",
	"verse": "Mat. 7:21",
	"versetext": "\nNot everyone who says to me, ‘Lord, Lord,’ will enter into the Kingdom of Heaven; but he who does the will of my Father who is in heaven.\n\n"
}, {
	"date": "8/24",
	"poem": "After a long black night of evil and injustice\n\n\tThe sunrise illuminates the earth so clear and bright.\n\n\tAfter the passing of a dark and terrible tempest\n\n\tEvery blade of grass is washed and reflects the light.\n\n\tSo it will be when the Son of David returns again\n\n\tIn righteousness to judge, rule and reign over men.",
	"verse": "2Sam. 23:4",
	"versetext": "shall be as the light of the morning, when the sun rises,\na morning without clouds,\nwhen the tender grass springs out of the earth,\nthrough clear shining after rain.’\n"
}, {
	"date": "8/25",
	"poem": "If your loved ones have left you and gone\n\n\tDon’t despair, it is only for a short season.\n\n\tYou will see them again with Him in a little while\n\n\tComing in the clouds with a welcoming smile.",
	"verse": "1Th. 4:14",
	"versetext": "For if we believe that Jesus died and rose again, even so God will bring with him those who have fallen asleep in Jesus.\n"
}, {
	"date": "8/26",
	"poem": "Built one with the Ark were two Cherubim shining bright\n\n\tWho saw each other mirrored on the throne of grace\n\n\tAs they continually gazed down through the Blood and Light.\n\n\tLet this be the way we witness and see one another’s face.",
	"verse": "Ex. 25:20",
	"versetext": "The cherubim shall spread out their wings upward, covering the mercy seat with their wings, with their faces toward one another. The faces of the cherubim shall be toward the mercy seat.\n"
}, {
	"date": "8/27",
	"poem": "There once was a brother from Newark\n\n\tWho didn’t know from which end to start.\n\n\tHe was always of two minds\n\n\tNeither of which he could find.\n\n\tHe straddled the fence and sat in two boats at the same time\n\n\tUntil he gave up on making up his mind and found God’s heart.",
	"verse": "Jas. 4:8",
	"versetext": "Draw near to God, and he will draw near to you. Cleanse your hands, you sinners; and purify your hearts, you double-minded.\n"
}, {
	"date": "8/28",
	"poem": "Oh Master pierce my ear\n\n\tSo that I may hear and be near thee\n\n\tFor all of time and eternity.",
	"verse": "Ex. 21:6",
	"versetext": "then his master shall bring him to God, and shall bring him to the door or to the doorpost, and his master shall bore his ear through with an awl, and he shall serve him for ever.\n"
}, {
	"date": "8/29",
	"poem": "God is not worried that you will not choose His Son.\n\n\tThough it is your own soul’s decision.\n\n\tHe knows that you will make the right one\n\n\tAs He had already chosen you before creation.",
	"verse": "Rom. 8:29",
	"versetext": "For whom he foreknew, he also predestined to be conformed to the image of his Son, that he might be the firstborn among many brothers.\n"
}, {
	"date": "8/30",
	"poem": "When you hear a mighty minster has fallen in disgrace\n\n\tDon’t be shaken or leave your place.\n\n\tHaving a gift doesn’t mean you earned it.\n\n\tYou can teach others without having learned it.",
	"verse": "1Cor. 9:27",
	"versetext": "but I beat my body and bring it into submission, lest by any means, after I have preached to others, I myself should be rejected.\n"
}, {
	"date": "8/31",
	"poem": "The tempter took Jesus to the pinnacle of the temple,\n\n\tAnd there to the Living Word he quoted the Bible.\n\n\tJudas went out with the twelve to heal and preach the Kingdom\n\n\tAnd he was probably the best and most successful one.\n\n\tMany preach salvation while living lost in sin.\n\n\tEven if a man eats gold it doesn’t become a part of him.",
	"verse": "Php. 1:15",
	"versetext": "Some indeed preach Christ even out of envy and strife, and some also out of good will.\n"
}, {
	"date": "9/1",
	"poem": "When you rightly divide the Scripture\n\n\tDon’t add, subtract and rearrange it,\n\n\tOr chop and change to make it fit\n\n\tAnd make it say what you want it to.\n\n\tLet the Word do that to you.\n\n\tBy it, all your doctrines measure.",
	"verse": "2Tim. 2:15",
	"versetext": "Give diligence to present yourself approved by God, a workman who doesn’t need to be ashamed, properly handling the Word of Truth.\n"
}, {
	"date": "9/2",
	"poem": "Greed for things you ultimately can’t keep,\n\n\tAnd obsessing over goods to save and store,\n\n\tMakes the property you protect become the thief,\n\n\tAnd what you own ends up owning you more.",
	"verse": "Jas. 5:3",
	"versetext": "Your gold and your silver are corroded, and their corrosion will be for a testimony against you, and will eat your flesh like fire. You have laid up your treasure in the last days.\n"
}, {
	"date": "9/3",
	"poem": "His rest\n\n\tIs best!",
	"verse": "Mat. 11:28",
	"versetext": "\n“Come to me, all you who labor and are heavily burdened, and I will give you rest.\n\n"
}, {
	"date": "9/4",
	"poem": "Some dig their grave with a spoon.\n\n\tDon’t let your belly precede you into a room,\n\n\tOr let lifestyle diseases be your doom.\n\n\tPush away your plate and your tomb.",
	"verse": "Prov. 23:2",
	"versetext": "put a knife to your throat,\nif you are a man given to appetite.\n"
}, {
	"date": "9/5",
	"poem": "A man and woman,\n\n\tAs husband and wife\n\n\tAre in partnership for life\n\n\tAnd it is not a life sentence.\n\n\tEven if their marriage has strife\n\n\tThey should never repent it.\n\n\tYour match is God’s plan.",
	"verse": "Pro. 18:22",
	"versetext": "Whoever finds a wife finds a good thing,\nand obtains favor of Yahweh.\n"
}, {
	"date": "9/6",
	"poem": "Many don’t discover until they are old\n\n\tThat every new day is as mined gold.\n\n\tEach sunrise we see is bright and precious\n\n\tBut quickly becomes one less treasure left us\n\n\tThat the turning world below still holds.",
	"verse": "Psa. 90:12",
	"versetext": "So teach us to count our days,\nthat we may gain a heart of wisdom.\n"
}, {
	"date": "9/7",
	"poem": "We need Revival,\n\n\tNot just survival.",
	"verse": "Psa. 138:7",
	"versetext": "Though I walk in the middle of trouble, you will revive me.\nYou will stretch out your hand against the wrath of my enemies.\nYour right hand will save me.\n"
}, {
	"date": "9/8",
	"poem": "Drink a little wine,\n\n\tReferred to by drunkards all the time.\n\n\tDo not judge lest you be condemned,\n\n\tOften referenced by rebels to excuse their sin.",
	"verse": "Lk. 6:37",
	"versetext": "\nDon’t judge,\nand you won’t be judged.\nDon’t condemn,\nand you won’t be condemned.\nSet free,\nand you will be set free.\n"
}, {
	"date": "9/9",
	"poem": "Some are like bakers selling bread\n\n\tWhile leaving their families unfed.\n\n\tOr doctors that heal those that are ill\n\n\tBut by neglect their own offspring kill.\n\n\tDon’t just give it,\n\n\tLive it!",
	"verse": "Mat. 7:21",
	"versetext": "\nNot everyone who says to me, ‘Lord, Lord,’ will enter into the Kingdom of Heaven; but he who does the will of my Father who is in heaven.\n\n"
}, {
	"date": "9/10",
	"poem": "Listening for the Lord’s knock on your door\n\n\tHelps you get ready to rise and soar.\n\n\tThinking the Lord will return at any instant\n\n\tWill help make and keep you ready for it.",
	"verse": "1Th. 4:16",
	"versetext": "For the Lord himself will descend from heaven with a shout, with the voice of the archangel, and with God’s trumpet. The dead in Christ will rise first,\n"
}, {
	"date": "9/11",
	"poem": "When all is dark and silent\n\n\tHe gives songs in the night.\n\n\tAt times God will be your only delight,\n\n\tAnd He will be the only One to hear it.",
	"verse": "Job 35:10",
	"versetext": "But no one says, ‘Where is God my Maker,\nwho gives songs in the night,\n"
}, {
	"date": "9/12",
	"poem": "God gives His peace in the fear\n\n\tWhen shadows and threats are near.\n\n\tThere are dark valleys you must pass through\n\n\tBut His Ever-present Help is with you.",
	"verse": "Psa. 23:4",
	"versetext": "Even though I walk through the valley of the shadow of death,\nI will fear no evil, for you are with me.\nYour rod and your staff,\nthey comfort me.\n"
}, {
	"date": "9/13",
	"poem": "A subterranean river still flows\n\n\tEven if the eye of no man knows.\n\n\tA breeze no one breathes still blows.\n\n\tGrass sprouts even when no one sows,\n\n\tAnd the unseen evergreen still grows.\n\n\tDon’t think your life’s work is a feast untasted.\n\n\tWith God as your witness nothing is ever wasted.",
	"verse": "Rom. 11:33",
	"versetext": "Oh the depth of the riches both of the wisdom and the knowledge of God! How unsearchable are his judgments, and his ways past tracing out!\n"
}, {
	"date": "9/14",
	"poem": "There is music only you can make.\n\n\tThere is art only you can create.\n\n\tThe One and Only God made you an individual.\n\n\tYour soul and gift are unique and irreplaceable.",
	"verse": "Rom. 11:29",
	"versetext": "For the gifts and the calling of God are irrevocable.\n"
}, {
	"date": "9/15",
	"poem": "Be as the trees.\n\n\tReach up higher and higher like them,\n\n\tAlways hungering for the light of heaven.\n\n\tSing when the wind of the Spirit moves.\n\n\tClap your hands for joy like their leaves,\n\n\tLimbs and branches do in the breeze.",
	"verse": "Isa. 55:12",
	"versetext": "For you shall go out with joy,\nand be led out with peace.\nThe mountains and the hills will break out before you into singing;\nand all the trees of the fields will clap their hands.\n"
}, {
	"date": "9/16",
	"poem": "Be as the Cedar of Lebanon, Palm and Olive\n\n\tPlanted forever in God’s courts and house,\n\n\tAlways digging deeper, rooted in His faith, hope and love.\n\n\tDrinking from hidden rivers of life and delight.\n\n\tBe evergreen, fruitful and flourishing in His light.",
	"verse": "Psa. 92:12",
	"versetext": "The righteous shall flourish like the palm tree.\nHe will grow like a cedar in Lebanon.\n"
}, {
	"date": "9/17",
	"poem": "Unseen growth,\n\n\tRooted down,\n\n\tBefore growth upward\n\n\tAnd fruit is found.",
	"verse": "2Ki. 19:30",
	"versetext": "The remnant that has escaped of the house of Judah will again take root downward, and bear fruit upward.\n"
}, {
	"date": "9/18",
	"poem": "Since most men no longer farm or work the soil\n\n\tThey can’t appreciate the happiness of a harvest\n\n\tThat comes after a long season of anticipation and toil.\n\n\tBut we will soon be reaped and gathered up to our rest,\n\n\tWhen after years of tears and fears comes the Rapture\n\n\tAnd our sorrow is turned into rejoicing and laughter.",
	"verse": "Psa. 126:6",
	"versetext": "He who goes out weeping, carrying seed for sowing,\nwill certainly come again with joy, carrying his sheaves.\n"
}, {
	"date": "9/19",
	"poem": "A slain and risen lamb stands on Zion\n\n\tWith a multitude in the midst of the mountain,\n\n\tAnd also at its summit and foundation,\n\n\tA Stone cut without hands, breaking others down,\n\n\tAnd filling all the earth with His Kingdom.",
	"verse": "Dan. 2:35",
	"versetext": "Then the iron, the clay, the brass, the silver, and the gold were broken in pieces together, and became like the chaff of the summer threshing floors. The wind carried them away, so that no place was found for them. The stone that struck the image became a great mountain, and filled the whole earth.\n"
}, {
	"date": "9/20",
	"poem": "Just because Jehovah is so high\n\n\tDoesn’t mean you shouldn’t try\n\n\tTo draw near Him.\n\n\tJust because Jesus is so lowly and meek\n\n\tDoesn’t mean you shouldn’t seek\n\n\tTo hide beside Him.",
	"verse": "Psa. 138:6",
	"versetext": "For though Yahweh is high, yet he looks after the lowly;\nbut the proud, he knows from afar.\n"
}, {
	"date": "9/21",
	"poem": "Lord You are the living stone\n\n\tRejected now by men,\n\n\tOnly recognized by revelation.\n\n\tLike Peter, I return to You again.",
	"verse": "1Pet. 2:4",
	"versetext": "coming to him, a living stone, rejected indeed by men, but chosen by God, precious.\n"
}, {
	"date": "9/22",
	"poem": "A pristine, polished Bible on the table\n\n\tReminds me of a feast uneaten.\n\n\tSo sit down and with both hands dig in.\n\n\tThe more you eat, the more you will be able.",
	"verse": "Jer. 15:16",
	"versetext": "Your words were found,\nand I ate them.\nYour words were to me a joy and the rejoicing of my heart,\nfor I am called by your name, Yahweh, God of Armies.\n"
}, {
	"date": "9/23",
	"poem": "From every good thing Satan makes evil come.\n\n\tGod takes bad and makes good through His son.",
	"verse": "Heb. 2:14",
	"versetext": "Since then the children have shared in flesh and blood, he also himself in the same way partook of the same, that through death he might bring to nothing him who had the power of death, that is, the devil,\n"
}, {
	"date": "9/24",
	"poem": "Oh, Most Holy One\n\n\tRuler of all,\n\n\tTo You I call.\n\n\tThy will be done!",
	"verse": "Mat. 6:10",
	"versetext": "\nLet your Kingdom come. Let your will be done, as in heaven, so on earth.\n\n"
}, {
	"date": "9/25",
	"poem": "Lord,\n\n\tEvery day,\n\n\tIn every way,\n\n\tWe will worship and adore.",
	"verse": "Psa. 44:8",
	"versetext": "In God we have made our boast all day long,\nwe will give thanks to your name forever.\nSelah.\n"
}, {
	"date": "9/26",
	"poem": "Living God, loving Lord Jesus,\n\n\tBy Your Holy Spirit inspire us\n\n\tTo lift to You our hands, our hearts, our all.\n\n\tAnd at the same time bow face down in awe.",
	"verse": "Psa. 57:5",
	"versetext": "Be exalted, God, above the heavens!\nLet your glory be above all the earth!\n"
}, {
	"date": "9/27",
	"poem": "Before the temple in Jerusalem stood two pillars of brass\n\n\tWhich were even given names, Jachin and Boaz.\n\n\tThey were two strong and silent witnesses\n\n\tTestifying ‘In Him is Strength’ and ‘He Establishes.’",
	"verse": "1Ki. 7:21",
	"versetext": "He set up the pillars at the porch of the temple. He set up the right pillar, and called its name Jachin; and he set up the left pillar, and called its name Boaz.\n"
}, {
	"date": "9/28",
	"poem": "Those two pillars carried no weight, nor bore any roof,\n\n\tBut were solid, steadfast, and visible proof\n\n\tThat when manifold sufferings surround\n\n\tHis supporting grace will never let us down,\n\n\tAnd even if encompassed by multitudes of enemies,\n\n\tBy the unseen God’s strength, we will stand in victory.",
	"verse": "1Pet. 5:10",
	"versetext": "But may the God of all grace, who called you to his eternal glory by Christ Jesus, after you have suffered a little while, perfect, establish, strengthen, and settle you.\n"
}, {
	"date": "9/29",
	"poem": "We can all be immersed together\n\n\tIn the Spirits living river,\n\n\tWhile as individuals we can imbibe\n\n\tFrom that same stream of life.",
	"verse": "1Cor. 12:13",
	"versetext": "For in one Spirit we were all baptized into one body, whether Jews or Greeks, whether bond or free; and were all given to drink into one Spirit.\n"
}, {
	"date": "9/30",
	"poem": "Holy Spirit, envelop and indwell,\n\n\tLike a flood and a well,\n\n\tWind breathe upon us and within,\n\n\tBe fire surrounding and empowering,\n\n\tAnd oil anointing and absorbed,\n\n\tBaptize and fill us Lord!",
	"verse": "Mat. 3:11",
	"versetext": "I indeed baptize you in water for repentance, but he who comes after me is mightier than I, whose shoes I am not worthy to carry. He will baptize you in the Holy Spirit.\n"
}, {
	"date": "10/1",
	"poem": "To adults cynical and jaded\n\n\tNothing is scared\n\n\tAnd innocence is overrated.\n\n\tYet Jesus tells us to be converted\n\n\tWith hearts becoming like little children\n\n\tIf we want to enter His Kingdom of Heaven.",
	"verse": "Mat. 18:3",
	"versetext": "and said,\n“Most certainly I tell you, unless you turn, and become as little children, you will in no way enter into the Kingdom of Heaven.\n\n"
}, {
	"date": "10/2",
	"poem": "Don’t worry about your reputation\n\n\tOr the public’s perception.\n\n\tOnly God sees the true you\n\n\tAnd knows you better that you do.\n\n\tIn fact, you are actually so wicked and bad inside,\n\n\tIt is something from you that God must hide.",
	"verse": "Jer. 17:9",
	"versetext": "The heart is deceitful above all things\nand it is exceedingly corrupt.\nWho can know it?\n"
}, {
	"date": "10/3",
	"poem": "There is a certain kind of tyranny\n\n\tIn the New Testament Pharisee\n\n\tWith their super-spirituality\n\n\tAnd self-proclaimed authority.\n\n\tSince they have all the answers for being perfected\n\n\tThere is no way they will listen or be corrected.\n\n\tThey refuse to see their religion is a form of idolatry.",
	"verse": "Mat. 23:26",
	"versetext": "\nYou blind Pharisee, first clean the inside of the cup and of the platter, that its outside may become clean also.\n"
}, {
	"date": "10/4",
	"poem": "Rejoice!\n\n\tIt not hard to say again,\n\n\tRejoice again.\n\n\tKeep going.\n\n\tNever let it end!",
	"verse": "Php. 4:4",
	"versetext": "Rejoice in the Lord always! Again I will say, “Rejoice!”\n"
}, {
	"date": "10/5",
	"poem": "You have only a certain number of days\n\n\tBut no limit to your worship and praise.",
	"verse": "Psa. 90:12",
	"versetext": "So teach us to count our days,\nthat we may gain a heart of wisdom.\n"
}, {
	"date": "10/6",
	"poem": "So many fallen generations and forgotten nations\n\n\tHave returned and turned to dust,\n\n\tJust as any future ones must.\n\n \tFacing such futility and vanity all is lost\n\n\tWithout the triumph of the Cross and Resurrection",
	"verse": "Psa. 144:4",
	"versetext": "Man is like a breath.\nHis days are like a shadow that passes away.\n"
}, {
	"date": "10/7",
	"poem": "Many of the nouns you lust for\n\n\tWon’t matter anymore\n\n\tOnce you’ve got them,\n\n\tYou’ll just thirst for more.",
	"verse": "1John 2:17",
	"versetext": "The world is passing away with its lusts, but he who does God’s will remains forever.\n"
}, {
	"date": "10/8",
	"poem": "God is terrible, in a wonderful way.\n\n\tHis Magnificent Majesty\n\n\tIs so high above all we can see or say.\n\n\tWe tremble and fall in awe at His glory.",
	"verse": "Psa. 47:2",
	"versetext": "For Yahweh Most High is awesome.\nHe is a great King over all the earth.\n"
}, {
	"date": "10/9",
	"poem": "Imagine there’s no heaven\n\n\tIt’s easy if you lie\n\n\tNo hell below us\n\n\tAs the dammed deny.\n\n\tImagine all the deceived\n\n\tDying in their sin.\n\n\tI hope you will never join them\n\n\tAnd that you become Born Again.",
	"verse": "Psa. 14:1",
	"versetext": "The fool has said in his heart, “There is no God.”\nThey are corrupt.\nThey have done abominable deeds.\nThere is no one who does good.\n"
}, {
	"date": "10/10",
	"poem": "Perhaps you don’t want to give up your life.\n\n\tIt only natural you should feel this way.\n\n\tUntil today that attitude has helped you to survive.\n\n\tBut since we all are leaving this earth anyway\n\n\tWhy not say no to you and give your life to God willingly?\n\n\tTake up your cross and do what the Lord tells you to.\n\n\tThere is something supernatural waiting for you.",
	"verse": "Mark 8:34",
	"versetext": "He called the multitude to himself with his disciples, and said to them,\n“Whoever wants to come after me, let him deny himself, and take up his cross, and follow me.\n\n"
}, {
	"date": "10/11",
	"poem": "It used to be in the West that the greatest sin was racism\n\n\tWhich is hating someone for their culture, custom or skin.\n\n\tNow the greatest cultural crime is to hate a sin\n\n\tThat God and nature finds an abomination,\n\n\tWhich is the perverse and abhorrent Sin of Sodom",
	"verse": "Rom. 1:27",
	"versetext": "Likewise also the men, leaving the natural function of the woman, burned in their lust toward one another, men doing what is inappropriate with men, and receiving in themselves the due penalty of their error.\n"
}, {
	"date": "10/12",
	"poem": "You may not be a mighty Christian superhero\n\n\tWith a megachurch, mega smile and anointed preaching,\n\n\tAnd don’t have a gift of deliverance or divine healing.\n\n\tAs a Christian musician your top ten hits are less than zero.\n\n\tYou have no program on the net, TV or radio.\n\n\tBy modern standards of measuring popularity and fame\n\n\tYou have no value, and nobody knows your name.\n\n\tStop judging yourself by worldly standards of success,\n\n\tAnd know in Jesus Christ you are precious and blessed.",
	"verse": "Lk. 16:22",
	"versetext": "\nThe beggar died, and he was carried away by the angels to Abraham’s bosom. The rich man also died, and was buried.\n\n"
}, {
	"date": "10/13",
	"poem": "All those terrible warnings and woes\n\n\tPronounced by the Prophets so long ago\n\n\tOver rebellious men and nations\n\n\tWere given over and over before anything was done.\n\n\tOften it looked like the enemy had won\n\n\tAnd God’s punishment would never come.\n\n\tIn our current time of complacency and security\n\n\tIt’s all just an old story and ancient history.\n\n\tOnce again men scoff, forget or are willingly ignorant\n\n\tThat the next one to come is the Last Judgement.",
	"verse": "2Pet. 3:5",
	"versetext": "For this they willfully forget, that there were heavens from of old, and an earth formed out of water and amid water, by the word of God;\n"
}, {
	"date": "10/14",
	"poem": "Wake up, get up, in whatever zone or clime.\n\n\tChrist has been shining all this time.\n\n\tRise up from your bed\n\n\tAnd stop being spiritually dead.",
	"verse": "Eph. 5:14",
	"versetext": "Therefore he says, “Awake, you who sleep, and arise from the dead, and Christ will shine on you.”\n"
}, {
	"date": "10/15",
	"poem": "Shake off your lethargy\n\n\tReceive resurrection energy.\n\n\tIt is never too late or early\n\n\tTo awaken to righteousness.\n\n\tLeap up, get dressed and be blessed.",
	"verse": "Rom. 13:11",
	"versetext": "Do this, knowing the time, that it is already time for you to awaken out of sleep, for salvation is now nearer to us than when we first believed.\n"
}, {
	"date": "10/16",
	"poem": "In returning and rest\n\n\tWe would have been blest\n\n\tBut we say we will not stay,\n\n\tOn our swift horses we will race away.\n\n\tSo off on our own thoughts and plans we flee\n\n\tTo end up losing all control and liberty.",
	"verse": "Isa. 30:15",
	"versetext": "For thus said the Lord Yahweh, the Holy One of Israel, “You will be saved in returning and rest. Your strength will be in quietness and in confidence.” You refused,\n"
}, {
	"date": "10/17",
	"poem": "The times when I consider myself the more wise\n\n\tI question, “why don’t they do things differently?”\n\n\tSo I’m tempted to overrule those that rule over me.\n\n\tBut then the Lord of lords helps me to realize\n\n\tThat so far, I haven’t even controlled me.",
	"verse": "Heb. 13:17",
	"versetext": "Obey your leaders and submit to them, for they watch on behalf of your souls, as those who will give account, that they may do this with joy, and not with groaning, for that would be unprofitable for you.\n"
}, {
	"date": "10/18",
	"poem": "When we rebel and do wrong continually\n\n\tWe become accustomed to sin and failure.\n\n\tBecause of our own stubborn behavior,\n\n\tDisobedient acts and defiance become familiar\n\n\tAnd eventually those habits become our character.\n\n\tLet the Beloved and obedient Son break your captivity.",
	"verse": "Jas. 1:15",
	"versetext": "Then the lust, when it has conceived, bears sin; and the sin, when it is full grown, produces death.\n"
}, {
	"date": "10/19",
	"poem": "Right now, towering over you and me\n\n\tAnd all of history, and eternity\n\n\tIs His awesome and glorious majesty\n\n\tThat one day all will bow before and see.\n\n\tWe have the privilege to do it presently.",
	"verse": "Php. 2:9",
	"versetext": "Therefore God also highly exalted him, and gave to him the name which is above every name;\n"
}, {
	"date": "10/20",
	"poem": "When the adversary repeats your past\n\n\tAnd all your former sins,\n\n\tRemember he cannot win.\n\n\tHis accusations will not last.\n\n\tThen you can remind that liar\n\n\tHis future is fixed and certain\n\n\tAfter he falls for a Millennium,\n\n\tThen forever in the Lake of Fire.",
	"verse": "Rev. 20:10",
	"versetext": "The devil who deceived them was thrown into the lake of fire and sulfur, where the beast and the false prophet are also. They will be tormented day and night forever and ever.\n"
}, {
	"date": "10/21",
	"poem": "There once was a madman named of ham and mud\n\n\tWho made a religion of peace which was really of blood\n\n\tWith martyrs who murdered and thought they did well\n\n\tBut woke to meet their false prophet, not in heaven, but hell.",
	"verse": "John 10:8",
	"versetext": "\nAll who came before me are thieves and robbers, but the sheep didn’t listen to them.\n\n"
}, {
	"date": "10/22",
	"poem": "Once while I was weeping in my private Gethsemane\n\n\tI sensed the presence of angels’ wings or’shadowing me,\n\n\tAnd thought God alone knows my great agony,\n\n\tHeaven is showing me some sympathy!\n\n\tBut it was only a big bird bombing me.\n\n\tThen laughing, I learned to get over me,\n\n\tAnd stop taking my own misery so seriously.",
	"verse": "Isa. 38:14",
	"versetext": "I chattered like a swallow or a crane.\nI moaned like a dove.\nMy eyes weaken looking upward.\nLord, I am oppressed.\nBe my security.”\n"
}, {
	"date": "10/23",
	"poem": "Preserve your heritage\n\n\tTreasure your inheritance\n\n\tDon’t trade it for a pot or hill of beans\n\n\tKeep your birthright, it can’t be replaced by anything.",
	"verse": "Heb. 12:16",
	"versetext": "lest there be any sexually immoral person, or profane person, like Esau, who sold his birthright for one meal.\n"
}, {
	"date": "10/24",
	"poem": "Don’t devalue the currency of your testimony\n\n\tYou can’t buy it back so cheaply or easily.",
	"verse": "Heb. 12:17",
	"versetext": "For you know that even when he afterward desired to inherit the blessing, he was rejected, for he found no place for a change of mind though he sought it diligently with tears.\n"
}, {
	"date": "10/25",
	"poem": "I wrote this silent song\n\n\tInstead of sang it.\n\n\tLet someone come along\n\n\tAnd add the music.",
	"verse": "John 4:37",
	"versetext": "\nFor in this the saying is true, ‘One sows, and another reaps.’\n\n"
}, {
	"date": "10/26",
	"poem": "Send Your Word to save and heal.\n\n\tSend Your Holy Spirit to seal.\n\n\tSend Your servants to make it real,\n\n\tAnd unsearchable riches reveal.",
	"verse": "Eph. 3:8",
	"versetext": "To me, the very least of all saints, was this grace given, to preach to the Gentiles the unsearchable riches of Christ,\n"
}, {
	"date": "10/27",
	"poem": "Certain musicians seeing the audience not moving\n\n\tAdd more instruments and crank up the volume.\n\n\tSome pastors when they see their flock is doubting\n\n\tPurchase bigger speakers and do more shouting.",
	"verse": "1Ki. 18:26",
	"versetext": "They took the bull which was given them, and they dressed it, and called on the name of Baal from morning even until noon, saying, “Baal, hear us!” But there was no voice, and nobody answered. They leaped about the altar which was made.\n"
}, {
	"date": "10/28",
	"poem": "Some preachers see their listeners bored and snoring\n\n\tSo they start jumping, pounding and roaring.\n\n\tBut like hope and love, faith is sometimes quiet.\n\n\tSo next time nothing is working, try it.",
	"verse": "1Cor. 13:1",
	"versetext": "If I speak with the languages of men and of angels, but don’t have love, I have become sounding brass, or a clanging cymbal.\n"
}, {
	"date": "10/29",
	"poem": "Next time you feel a meeting will never end\n\n\tThink poor tired Eutychus and his friends.\n\n\tPaul droned on so long he fell asleep and dead,\n\n\tOnly to have Paul raise him up again,\n\n\tThen keep on preaching until morning.",
	"verse": "Act 20:9",
	"versetext": "A certain young man named Eutychus sat in the window, weighed down with deep sleep. As Paul spoke still longer, being weighed down by his sleep, he fell down from the third floor, and was taken up dead.\n"
}, {
	"date": "10/30",
	"poem": "Even if your wounds are self-inflicted\n\n\tThey still hurt, and leave scars, but no reward.\n\n\tSo save yourself from being uselessly afflicted\n\n\tAnd let the Lord wield the sword.",
	"verse": "1Pet. 2:20",
	"versetext": "For what glory is it if, when you sin, you patiently endure beating? But if, when you do well, you patiently endure suffering, this is commendable with God.\n"
}, {
	"date": "10/31",
	"poem": "Satan get out and go away.\n\n\tIn Jesus’ Name, run!\n\n\tBy the power of God’s Son\n\n\tYou are not allowed to stay.",
	"verse": "Mark 16:17",
	"versetext": "\nThese signs will accompany those who believe: in my name they will cast out demons; they will speak with new languages;\n\n"
}, {
	"date": "11/1",
	"poem": "You may get glimpses of souls as you speed down a highway,\n\n\tWhen crowded and crushed by them on a sidewalk or subway,\n\n\tOr imagining their lives in the homes below as you fly by.\n\n\tTheir burdens are too many and heavy. What can one person do?\n\n\tThere are lots and lots of them and so little of you.\n\n\tBut as you hurry through the press and hasten past\n\n\tWith the help of the Helper at least you can broadcast\n\n\tA prayer for their salvation, healing and deliverance.\n\n\tThere’s no knowing below the fruits of the hurried blessings you sow.\n\n\tOnly in heaven will we see how those scattered seeds did grow.",
	"verse": "Ecc. 11:6",
	"versetext": "In the morning sow your seed,\nand in the evening don’t withhold your hand;\nfor you don’t know which will prosper, whether this or that,\nor whether they both will be equally good.\n"
}, {
	"date": "11/2",
	"poem": "There once was a woman from Bethany\n\n\tWho would try to hide herself from God\n\n\tIn busy work and odd jobs.\n\n\tNo one could ever dare disagree\n\n\tThat she did her duties diligently.\n\n\tYet not all of them were necessary,\n\n\tExcept as an escape from eternity.",
	"verse": "Lk. 10:41",
	"versetext": "Jesus answered her,\n“Martha, Martha, you are anxious and troubled about many things,\n\n"
}, {
	"date": "11/3",
	"poem": "Water in stone pots transformed into wine,\n\nNets filled, fish and bread multiplied,\n\nThe healing and deliverance of multitudes,\n\nAll these took place in the hands of disciples.\n\nJesus made all this happen as signs\n\nOf Who He is, and how He can use you,\n\nIf you just obey and do what He tells you to.",
	"verse": "Lk. 5:5",
	"versetext": "Simon answered him, “Master, we worked all night, and took nothing; but at your word I will let down the net.”\n"
}, {
	"date": "11/4",
	"poem": "Do you ever feel you never fulfil your full potential?\n\n\tSome reasons are lethargy and laziness,\n\n\tBut others are fear of failure and fear of success.\n\n\tThinking the more you do, the more you will be capable,\n\n\tThen more and more will be required, so you just stay still.\n\n\tOnly in Heaven will we achieve all that can possibly be done,\n\n\tYet still our Master commands us to occupy until He comes.",
	"verse": "Lk. 19:13",
	"versetext": "\nHe called ten servants of his, and gave them ten mina coins,\n\nand told them, ‘Conduct business until I come.’\n\n"
}, {
	"date": "11/5",
	"poem": "When the Lord leads\n\n\tMoment by moment, day by day\n\n\tHe meets all needs\n\n\tAnd will make a way.",
	"verse": "Isa. 48:17",
	"versetext": "Yahweh,\nyour Redeemer,\nthe Holy One of Israel says:\n“I am Yahweh your God,\nwho teaches you to profit,\nwho leads you by the way that you should go.\n"
}, {
	"date": "11/6",
	"poem": "‘The gates of Hell shall not prevail’\n\n\tDoes not mean the church is hiding behind them,\n\n\tBut that it is storming Satan’s citadel,\n\n\tBreaking down his fortress, and spoiling him.",
	"verse": "Mat. 16:18",
	"versetext": "\nI also tell you that you are Peter,\nand on this rock\n\nI will build my assembly, and the gates of Hades\nwill not prevail against it.\n\n"
}, {
	"date": "11/7",
	"poem": "Him I trust\n\n\tNot because I must\n\n\tBut because I want to.\n\n\tHe alone is totally true.",
	"verse": "Psa. 16:1",
	"versetext": "Preserve me, God, for in you do I take refuge.\n"
}, {
	"date": "11/8",
	"poem": "I am like an evergreen olive tree\n\n\tStrong, fruitful and flourishing\n\n\tPlanted where none is supposed to be seen.\n\n\tYet in His house I will abide eternally.",
	"verse": "Psa. 52:8",
	"versetext": "But as for me, I am like a green olive tree in God’s house.\nI trust in God’s loving kindness forever and ever.\n"
}, {
	"date": "11/9",
	"poem": "It is so sad to see those whose current destiny\n\n\tIs to end in eternal death and destruction\n\n\tMore worried about issues that end in vanity\n\n\tLike Global Warming and fighting pollution.\n\n\tSuch activism and zeal are admirable\n\n\tSaving the planet is a very noble goal,\n\n\tBut not at the cost of neglecting one’s soul.",
	"verse": "Mark 8:36",
	"versetext": "\nFor what does it profit a man, to gain the whole world, and forfeit his life?\n\n"
}, {
	"date": "11/10",
	"poem": "His rest is glorious\n\n\tHis choice the best.\n\n\tSo we look to Him,\n\n\tOur Ensign who is risen\n\n\tAnd returning victorious.",
	"verse": "Isa. 11:10",
	"versetext": "It will happen in that day that the nations will seek the root of Jesse, who stands as a banner of the peoples; and his resting place will be glorious.\n"
}, {
	"date": "11/11",
	"poem": "On a forgotten foreign battlefield\n\n\tI saw many well-ordered headstones,\n\n\tCratered meadows that harvest still yielded\n\n\tTo fill mausoleums stacked with unknown bones.\n\n\tWith the evidence before me of the deaths of so many\n\n\tWho gave or lost all for their earthly country\n\n\tI thought, why don’t I do it for the heavenly?",
	"verse": "1John 3:16",
	"versetext": "By this we know love, because he laid down his life for us. And we ought to lay down our lives for the brothers.\n"
}, {
	"date": "11/12",
	"poem": "Like Sons of Abraham, we are pilgrims.\n\n\tWe don’t know for how long or how far\n\n\tBut we hope our sojourn below will soon be done\n\n\tAnd we leave sons of sand to join the ones of stars.",
	"verse": "Heb. 11:12",
	"versetext": "Therefore as many as the stars of the sky in multitude, and as innumerable as the sand which is by the sea shore, were fathered by one man, and him as good as dead.\n"
}, {
	"date": "11/13",
	"poem": "He found us in our low estate,\n\n\tIn a blasted and darkened desert.\n\n\tYet we were to the Most High\n\n\tAs the apple of His eye,\n\n\tProtected and precious.",
	"verse": "Deut. 32:10",
	"versetext": "He found him in a desert land,\nin the waste howling wilderness.\nHe surrounded him.\nHe cared for him.\nHe kept him as the apple of his eye.\n"
}, {
	"date": "11/14",
	"poem": "As long as I shall live\n\n\tPraise to God I will give,\n\n\tAnd if I die and fly\n\n\tI will do it even more on high.",
	"verse": "Psa. 104:33",
	"versetext": "I will sing to Yahweh as long as I live.\nI will sing praise to my God while I have any being.\n"
}, {
	"date": "11/15",
	"poem": "Are spiritual offspring missing?\n\n\tMaybe you have stopped bearing\n\n\tBecause you are no longer sharing.\n\n\tGet witnessing.",
	"verse": "Heb. 2:13",
	"versetext": "Again, “I will put my trust in him.” Again, “Behold, here I am with the children whom God has given me.”\n"
}, {
	"date": "11/16",
	"poem": "Yes, flowers do fade and decay into dust,\n\n\tAnd every durable thing will melt and rust,\n\n\tNevertheless, use each bit of beauty you experience,\n\n\tEven though it ends in loss and death,\n\n\tTo give praise to God with each brief breath.",
	"verse": "Psa. 150:6",
	"versetext": "Let everything that has breath praise Yah!\nPraise Yah!\n"
}, {
	"date": "11/17",
	"poem": "Light is sweet to see\n\n\tAnd so is the sun.\n\n\tLife is precious,\n\n\tWe only get one.\n\n\tBut His lovingkindness\n\n\tIs better utterly,\n\n\tAnd ever was,\n\n\tAnd ever will be.",
	"verse": "Ecc. 11:7",
	"versetext": "Truly the light is sweet,\nand a pleasant thing it is for the eyes to see the sun.\n"
}, {
	"date": "11/18",
	"poem": "Signs of Sodom whose end will come again:\n\n\tFirst, the first sin, pride like Satan.\n\n\tSo overfed and fat while they let the starving diet,\n\n\tAbundant entertainment and leisure,\n\n\tFulltime surrender to lust and pleasure.\n\n\tThen in the end, homosexual abomination.\n\n\tDoesn’t this sound like developed nations,\n\n\tAnd this final generation?",
	"verse": "Eze. 16:49",
	"versetext": "“‘“Behold, this was the iniquity of your sister Sodom: pride, fullness of bread, and prosperous ease was in her and in her daughters. She also didn’t strengthen the hand of the poor and needy.\n"
}, {
	"date": "11/19",
	"poem": "Signs of the last days:\n\n\tSaving whales and trees, but murder unborn babies.\n\n\tFearing global warming but not Hell they are headed for.\n\n\tDisobedient children to whom parents surrender.\n\n\tAbasing themselves lower than beasts, that at least know their gender.\n\n\tWhen these signs of the time take place\n\n\tIt marks the end of the period of grace.",
	"verse": "2Tim. 3:1",
	"versetext": "But know this, that in the last days, grievous times will come.\n"
}, {
	"date": "11/20",
	"poem": "Collecting, keeping, hoarding and heaping possessions\n\n\tCan become an endless obsession.\n\n\tCeaseless chasing of bargains and good deals\n\n\tWill hinder you from riches that are real.",
	"verse": "Lk. 12:21",
	"versetext": "\nSo is he who lays up treasure for himself, and is not rich toward God.”\n"
}, {
	"date": "11/21",
	"poem": "Many give thanks before they eat,\n\n\tNot many after they leave their seat.\n\n\tMost will pray and plead\n\n\tWhen hungry or in need\n\n\tBut when fat and fit,\n\n\tThey forget to do it.",
	"verse": "Deu. 8:10",
	"versetext": "You shall eat and be full, and you shall bless Yahweh your God for the good land which he has given you.\n"
}, {
	"date": "11/22",
	"poem": "It isn’t when we are hungry and thirsty\n\n\tBut when all is going good and easy\n\n\tThat we neglect thankfulness\n\n\tAnd lose our gratefulness.\n\n\tTherefore, after you have everything you need\n\n\tKeep an attitude of gratitude for all you received.",
	"verse": "Deu. 8:11",
	"versetext": "Beware lest you forget Yahweh your God, in not keeping his commandments, and his ordinances, and his statutes, which I command you today;\n"
}, {
	"date": "11/23",
	"poem": "God ever lives,\n\n\tAs do you though Jesus.\n\n\tYou are His.\n\n\tThanks ever give!",
	"verse": "Hos. 1:10",
	"versetext": "Yet the number of the children of Israel will be as the sand of the sea, which can’t be measured or counted; and it will come to pass that, in the place where it was said to them, ‘You are not my people,’ they will be called ‘sons of the living God.’\n"
}, {
	"date": "11/24",
	"poem": "You have enemies and valleys to go through.\n\n\tGoodness and mercy will follow you.\n\n\tThey do not always go ahead.\n\n\tThat was done by the Good Shepherd.",
	"verse": "Psa. 23:6",
	"versetext": "Surely goodness and loving kindness shall follow me all the days of my life,\nand I will dwell in Yahweh’s house forever.\n"
}, {
	"date": "11/25",
	"poem": "So many are seeking for psychics and supermen\n\n\tWith magic and superpowers at their command.\n\n\tAdults are following fantasies not fit for children\n\n\tWith witches and mutants as their champions.\n\n\tBut the real hero came down from heaven\n\n\tLeaving His powers behind to live as a lowly mortal man.\n\n\tHe defeated sin, death and Satan when He rose again.",
	"verse": "Php. 2:7",
	"versetext": "but emptied himself, taking the form of a servant, being made in the likeness of men.\n"
}, {
	"date": "11/26",
	"poem": "Many want to be idols, stars and all the rage,\n\n\tAnd play the leading part in history.\n\n\tBut before time began, that role was His Story.\n\n \tSo stop all the drama and give Jesus the stage.",
	"verse": "Col. 1:18",
	"versetext": "He is the head of the body, the assembly, who is the beginning, the firstborn from the dead; that in all things he might have the preeminence.\n"
}, {
	"date": "11/27",
	"poem": "Men don’t need to look without for treasure,\n\n\tFortune, wealth and lasting pleasure.\n\n\tThey need not mine or dive for riches,\n\n\tNor chase rainbows, Lotos, cards or horses.\n\n\tOnly in Jesus is lasting and true value hidden.\n\n\tWhen we find Christ and His Kingdom within we win.",
	"verse": "Col. 1:27",
	"versetext": "to whom God was pleased to make known what are the riches of the glory of this mystery among the Gentiles, which is Christ in you, the hope of glory;\n"
}, {
	"date": "11/28",
	"poem": "When you see a sunrise, thank God for your eyes.\n\n\tWhen you see a sunset, thank God who created it.",
	"verse": "Psa. 113:3",
	"versetext": "From the rising of the sun to the going down of the same,\nYahweh’s name is to be praised.\n"
}, {
	"date": "11/29",
	"poem": "When after a storm you see a rainbow\n\n\tThank God, that for you, His anger was slow.",
	"verse": "Gen. 9:13",
	"versetext": "I set my rainbow in the cloud, and it will be a sign of a covenant between me and the earth.\n"
}, {
	"date": "11/30",
	"poem": "Whenever you see gathering cloud,\n\n\tListen for His voice to shout out loud.",
	"verse": "Rev. 1:7",
	"versetext": "Behold, he is coming with the clouds, and every eye will see him, including those who pierced him. All the tribes of the earth will mourn over him. Even so, Amen.\n"
}, {
	"date": "12/1",
	"poem": "Underneath, His everlasting, almighty arms.\n\n\tOver, His infinite wings protecting from harm.\n\n\tIlluminating whirlwind at night turns to sheltering cloud by day.\n\n\tHe defends before, behind, through all time and in all our way.",
	"verse": "Deut. 33:27",
	"versetext": "The eternal God is your dwelling place.\nUnderneath are the everlasting arms.\nHe thrust out the enemy from before you,\nand said, ‘Destroy!’\n"
}, {
	"date": "12/2",
	"poem": "The joy set before Him\n\n\tWasn’t just to see the Bride\n\n\tBut to sit together again\n\n\tAt His Father’s side.",
	"verse": "Hebrews 12:2",
	"versetext": "looking to Jesus, the author and perfecter of faith, who for the joy that was set before him endured the cross, despising its shame, and has sat down at the right hand of the throne of God.\n"
}, {
	"date": "12/3",
	"poem": "“Awake thou that sleepest, and arise from the dead,”\n\n\tNot one of my favorite Scripture quotations.\n\n\tLet the sunrise wait, I plead prone on my bed.\n\n\tThe Old Man kept me up too late to function.\n\n\tBut the New Man wants revival and resurrection.\n\n\tBy which one of them should I be led?",
	"verse": "Eph. 5:14",
	"versetext": "Therefore he says, “Awake, you who sleep, and arise from the dead, and Christ will shine on you.”\n"
}, {
	"date": "12/4",
	"poem": "Extra days means extra praise\n\n\tFor the Ancient of Days.\n\n\tTherefore, the longer you live\n\n\tThe more of it you can give.\n\n\tIf you survive a little more,\n\n\tUse it to serve Him and adore.",
	"verse": "Psa. 146:2",
	"versetext": "While I live, I will praise Yahweh.\nI will sing praises to my God as long as I exist.\n"
}, {
	"date": "12/5",
	"poem": "We are called to know Him Who passes knowing,\n\n\tAnd make the Infinite, Eternal, Unknowable known.\n\n\tTo discover and describe the indescribable,\n\n\tComprehend Him who is without measure,\n\n\tApprehend Him Who has already captured us,\n\n\tBe filled with the infinite fullness\n\n\tOf Him Who fills all and overflows.",
	"verse": "Eph. 3:19",
	"versetext": "and to know Christ’s love which surpasses knowledge, that you may be filled with all the fullness of God.\n"
}, {
	"date": "12/6",
	"poem": "Shepherd of our soul\n\n\tEnfold and hold\n\n\tUs in Your fold.",
	"verse": "John 10:16",
	"versetext": "\nI have other sheep, which are not of this fold.\nI must bring them also, and they will hear my voice. They will become one flock with one shepherd.\n\n"
}, {
	"date": "12/7",
	"poem": "What do you have that you did not receive?\n\n\tAll that is not from above, you will have to leave.",
	"verse": "1Cor. 4:7",
	"versetext": "For who makes you different? And what do you have that you didn’t receive? But if you did receive it, why do you boast as if you had not received it?\n"
}, {
	"date": "12/8",
	"poem": "Take the rest of my time.\n\n\tRule over the little I have left.\n\n\tI can only claim today as mine\n\n\tAnd return it to You to be blest.",
	"verse": "Mat. 6:34",
	"versetext": "\nTherefore don’t be anxious for tomorrow, for tomorrow will be anxious for itself. Each day’s own evil is sufficient.\n"
}, {
	"date": "12/9",
	"poem": "When Jesus Christ is in control of us, time isn’t.\n\n\tHe caused the lengthening shadows to retreat,\n\n\tAnd for an entire day made the sun to stand.\n\n\tNow and forever, our times are in His Hand.",
	"verse": "Psa. 31:15",
	"versetext": "My times are in your hand.\nDeliver me from the hand of my enemies, and from those who persecute me.\n"
}, {
	"date": "12/10",
	"poem": "If you find out late that your life has been a waste,\n\n\tIn one day God can restore and reinstate what you lost.\n\n\tIf the brief time you have left seems too short,\n\n\tIn one day He can do a thousand years of work.\n\n\tYou are not limited or defined by years before and behind.\n\n\tLet Jesus be Lord, not just of your heart, but also of your time.",
	"verse": "Joel 2:25",
	"versetext": "I will restore to you the years that the swarming locust has eaten,\nthe great locust, the grasshopper, and the caterpillar,\nmy great army, which I sent among you.\n"
}, {
	"date": "12/11",
	"poem": "Today one can hear so many popular Christian artists\n\n\tJudging those they say are judgmental and legalistic.\n\n\tThey make sinners to be martyrs of their hypothetical hypocrites,\n\n\tWhile they call good evil and change light for darkness.\n\n\tAs they condemn God’s messengers of holiness\n\n\tThey promise their misled listeners freedom and liberty,\n\n\tWhile they themselves are in bondage and captivity.",
	"verse": "Isa. 5:20",
	"versetext": "Woe to those who call evil good, and good evil;\nwho put darkness for light,\nand light for darkness;\nwho put bitter for sweet,\nand sweet for bitter!\n"
}, {
	"date": "12/12",
	"poem": "Bless us. Keep us. Give grace.\n\n\tShine down on us Your uplifted face.\n\n\tPut Your Name on us, and give peace.",
	"verse": "Num. 6:25",
	"versetext": "Yahweh make his face to shine on you,\nand be gracious to you.\n"
}, {
	"date": "12/13",
	"poem": "We know not the way of the Spirit,\n\n\tWhere and How He works in secret,\n\n\tBut when He moves we hear it,\n\n\tLike the breeze in the trees\n\n\tThat blows where it pleases.\n\n\tLike the unborn baby in the womb,\n\n\tAnd sleeping saints in their tomb\n\n\tWhen God is finished we will see it.",
	"verse": "Psa. 139:15",
	"versetext": "My frame wasn’t hidden from you,\nwhen I was made in secret,\nwoven together in the depths of the earth.\n"
}, {
	"date": "12/14",
	"poem": "Eager expectation, hopeful anticipation;\n\n\tThinking that Jesus is near\n\n\tWill prepare you to hear\n\n\tAnd meet Him in the air.\n\n\tYou will be ready for resurrection\n\n\tEven if it’s not for another millennium.",
	"verse": "1John 2:18",
	"versetext": "Little children, these are the end times, and as you heard that the Antichrist is coming, even now many antichrists have arisen. By this we know that it is the final hour.\n"
}, {
	"date": "12/15",
	"poem": "God ever lives,\n\n\tAnd so shall we,\n\n\tTo worship eternally\n\n\tAnd all praise give.",
	"verse": "Psa. 145:1",
	"versetext": "I will exalt you, my God, the King.\nI will praise your name forever and ever.\n"
}, {
	"date": "12/16",
	"poem": "So many injuries and tragedies could have come,\n\n\tSo much damage to you could have been done,\n\n\tYet you are still here in the land of the living\n\n\tAnd not already buried in the earth sleeping.\n\n\tGod and His angels have kept you in all your way\n\n\tAnd they will watch and keep you until the final day.",
	"verse": "Psa. 91:11",
	"versetext": "For he will put his angels in charge of you,\nto guard you in all your ways.\n"
}, {
	"date": "12/17",
	"poem": "After your death will this world consider you a success\n\n\tIf you leave no monuments, buildings or businesses?\n\n\tWill your life have mattered if in the media you leave no memory,\n\n\tAnd your entire existence becomes a mystery to history?\n\n\tThe answer is No, from those who live only for fallen humanity.\n\n\tBut for us who look to the risen Savior, the answer is, Yes,\n\n\tAccording to His promise to us, “Thou shalt not be forgotten of me.”",
	"verse": "Isa. 44:21",
	"versetext": "Remember these things, Jacob and Israel;\nfor you are my servant.\nI have formed you.\nYou are my servant.\nIsrael, you will not be forgotten by me.\n"
}, {
	"date": "12/18",
	"poem": "From the sunrise until its going down,\n\n\tFrom the start of the year to its end,\n\n\tFrom our birth until resurrection,\n\n\tGod is our ever-present help and friend.",
	"verse": "Psa. 113:3",
	"versetext": "From the rising of the sun to the going down of the same,\nYahweh’s name is to be praised.\n"
}, {
	"date": "12/19",
	"poem": "God is leading you wherever you travel.\n\n\tThough some of the rocky roads He takes you on\n\n\tMake you feel you are chewing and sucking on gravel.\n\n\tYou will learn that even from the sharpest stone,\n\n\tSomething sweet and healing will come.",
	"verse": "Deut. 32:13",
	"versetext": "He made him ride on the high places of the earth.\nHe ate the increase of the field.\nHe caused him to suck honey out of the rock,\noil out of the flinty rock;\n"
}, {
	"date": "12/20",
	"poem": "If you knew you were losing your life today\n\n\tWould you suddenly start giving everything away?\n\n\tIf by this evening you were not going to be alive\n\n\tWould you start the day emptying your closet and hard drive?",
	"verse": "Lk. 12:20",
	"versetext": "\n“But God said to him, ‘You foolish one, tonight your soul is required of you. The things which you have prepared—whose will they be?’\n\n"
}, {
	"date": "12/21",
	"poem": "So many temporal things you hoard and hold\n\n\tAre weighing down your immortal soul.\n\n\tSo why not start lightening your load\n\n\tAnd unpack your bags before you go.",
	"verse": "1Tim. 6:7",
	"versetext": "For we brought nothing into the world, and we certainly can’t carry anything out.\n"
}, {
	"date": "12/22",
	"poem": "The promise is to us and our children\n\n\tAnd to all that were afar.\n\n\tWhen that verse was written\n\n\tWe the ones not there.\n\n\tBut now we can proclaim the same\n\n\tFor the following generations.",
	"verse": "Act. 2:39",
	"versetext": "For the promise is to you, and to your children, and to all who are far off, even as many as the Lord our God will call to himself.”\n"
}, {
	"date": "12/23",
	"poem": "Who first recognized and responded to the presence of Jesus?\n\n\tA young virgin who surrendered to God’s will being done,\n\n\tA baby in the womb rejoicing in his Lord before both were born,\n\n\tAn ancient aunt who had for so many years been barren,\n\n\tA senior citizen ready to depart in peace named Simeon,\n\n\tAnna, an aged and long widowed centenarian.\n\n\tAll those who society aborts, rejects and neglects\n\n\tStill have worth and work to do as witnesses.",
	"verse": "Lk. 2:30",
	"versetext": "for my eyes have seen your salvation,\n"
}, {
	"date": "12/24",
	"poem": "In the Bible birthday parties turned out bad.\n\n\tFrom both of them someone lost their head.\n\n\tAnd the expensive gifts given by the wise men\n\n\tAfter they first went to the wrong town by their wisdom\n\n\tLed to the deaths of the innocents in Bethlehem.",
	"verse": "Mat. 2:18",
	"versetext": "“A voice was heard in Ramah,\nlamentation, weeping and great mourning,\nRachel weeping for her children;\nshe wouldn’t be comforted,\nbecause they are no more.”\n"
}, {
	"date": "12/25",
	"poem": "Emmanuel, when You are with us all is well.\n\n\tYou know from where You come, and where You go.\n\n\tAt times we see You small, yet You are always in control,\n\n\tAnd the government is upon Your shoulder",
	"verse": "Isa. 7:14",
	"versetext": "Therefore the Lord himself will give you a sign. Behold, the virgin will conceive, and bear a son, and shall call his name Immanuel.\n"
}, {
	"date": "12/26",
	"poem": "You will not die but live.\n\n\tYou still have more praise to give.\n\n\tYou still have a testimony share.\n\n\tYou still have more fruit to bear.",
	"verse": "Psa. 118:17",
	"versetext": "I will not die, but live,\nand declare Yah’s works.\n"
}, {
	"date": "12/27",
	"poem": "No matter what has happened here\n\n\tYou will be satisfied forever there.\n\n\tHealthy and always happy in heaven,\n\n\tJoyful with strength that never ends.",
	"verse": "John 16:20",
	"versetext": "\nMost certainly I tell you, that you will weep and lament, but the world will rejoice. You will be sorrowful, but your sorrow will be turned into joy.\n\n"
}, {
	"date": "12/28",
	"poem": "Jesus is taking us for a ride to the other side\n\n\tBut our fears see the wind and waves, time and tide.\n\n\tAs we sink our unseen Master seems to hide.\n\n\tYet He is still in the boat and it is still afloat.\n\n\tEven if sometimes Jesus seems silent and asleep,\n\n\tHis promises and passengers He will keep.",
	"verse": "Mark 4:35",
	"versetext": "On that day, when evening had come, he said to them,\n“Let’s go over to the other side.”\n"
}, {
	"date": "12/29",
	"poem": "God is going to bring you to an expected end\n\n\tA sheltered harbor and desired destination.\n\n\tHe alone knows all the thoughts for you He thinks\n\n\tAnd you will make it, you are not going to sink.",
	"verse": "Jer. 29:11",
	"versetext": "For I know the thoughts that I think toward you,” says Yahweh, “thoughts of peace, and not of evil, to give you hope and a future.\n"
}, {
	"date": "12/30",
	"poem": "Jesus may return this day or year.\n\n\tBut if not for another Century\n\n\tDo you have that much time to escape the cemetery?\n\n\tWhenever it is, soon we will meet Him together in the air!",
	"verse": "Rev. 22:20",
	"versetext": "He who testifies these things says,\n“Yes, I come quickly.”\n\nAmen! Yes, come, Lord Jesus.\n"
}, {
	"date": "12/31",
	"poem": "Often what the God showed you in the beginning\n\n\tHe will accomplish and fulfill at the ending.\n\n\tThe same kind of river, tree, garden,\n\n\tGoodly pearls and gold seen in Eden\n\n\tWill be fully revealed and realized in New Jerusalem.\n\n\tThat very last, very good thing made, a beautiful bride,\n\n\tAll will see as the Lamb’s Wife, forever at His side.",
	"verse": "Rev. 22:2",
	"versetext": "in the middle of its street. On this side of the river and on that was the tree of life, bearing twelve kinds of fruits, yielding its fruit every month. The leaves of the tree were for the healing of the nations.\n"
}]